[
{"t20_batting_innings": "21", "t20_50": "0", "t20_bowling_4W": "1", "t20_bowling_matches": "68", "t20_batting_matches": "68", "t20_BBM": "5/31", "player_ifo": ["{'Born':'\nAugust 28, 1983, Galle '}", "{'Current age':'34 years 291 days'}", "{'Major teams':'Sri Lanka,'}", "{'Also known as':'Separamadu Lasith Malinga Swarnajith'}", "{'Playing role':'Bowler'}"], "t20_BBI": "5/31", "t20_batting_NO": "8", "t20_bowling_econ": "7.36", "t20_bowling_balls": "1451", "t20_bowling_10W": "0", "t20_BF": "94", "t20_bowling_wickets": "90", "profile": ["\nOne of the great limited-overs bowlers in his pomp, Lasith Malinga gained a reputation for delivering searing inswinging yorkers from a round-arm action as destructive as it was distinctive. That yorker, a deceptive slower ball, and an excellent bouncer formed the body of Malinga's menace, while the action made his deliveries hard to pick up. All that ability was also set off by street smarts; Malinga was rarely shy to switch up plans, and reshuffle fields. Even when batsmen thought they knew what was about to come, Malinga retained the capacity to surprise. \n", "Found in his teens playing soft-ball cricket on the beaches of Rathgama, just north of Galle, Malinga became one of the poster boys for the informal Sri Lankan coaching system and its philosophy of equipping unconventional bowlers, rather than remaking them. Malinga has repeatedly credited Champaka Ramanayake for his success. It was Ramanayake who initially took interest in him, and with whom he developed the yorker that became the foundation of his career. The coach would glue a pair of shoes near the popping crease. Malinga would spend hours bowling at them. ", "Initially picked for his pace, Malinga toured Australia with the Sri Lanka team in 2004, where he claimed 6 for 90 in a tour match and went on to make his Test debut - he dismissed Darren Lehmann and Adam Gilchrist in the same over, in Darwin. During an impressive tour of New Zealand the following year, his low-slung action resulted in the New Zealand batsmen asking the umpire to change the colour of their trousers as the ball was getting lost.", "But it was in the shorter formats that destiny beckoned Malinga. He became the first - and, so far, only - bowler to claim four wickets in four balls, when he took Sri Lanka to the brink of victory against South Africa, in the 2007 World Cup. He has two more ODI hat-tricks - against Australia and Kenya - and he quickly established himself as Sri Lanka's limited-overs spearhead. Though Mahela Jayawardene, Kumar Sangakkara and Tillakaratne Dilshan also played important roles, Malinga was arguably the single-most important player in Sri Lanka's excellent run in global tournaments from 2007-2014.", "It is felt Malinga never realised his full potential in Tests, though perhaps through no fault of his own. He was only the third player to reach 100 Test wickets for Sri Lanka but a knee injury in 2008 laid him low for two years. He was picked again for Muttiah Muralitharan's farewell series, but again found himself injured for a period of some months. In April 2011, at the age of 27, Malinga announced his Test retirement, citing the desire to manage his \"chronic knee injury\" and extend his limited-overs career. It is thought his unique bowling action places a substantial load on the joints in his hips and legs. However, the fact that he announced his retirement while playing for Mumbai Indians in the IPL rankled at home. Through the forthcoming years, Malinga would go on to have a complicated relationship with Sri Lankan fans and media. In that time, he also became one of the IPL's iconic figures, representing Mumbai throughout.", "Malinga's finest moment came during the 2014 World T20, in which he nominally captained the side through the knockouts but, more importantly, delivered a clinical final spell to muzzle the India middle order. Sri Lanka would go on to win that title but, before long, Malinga's career became threatened by fitness issues - both involuntary and self-inflicted. In late 2014, a long-standing ankle complaint deteriorated to the extent that it required surgery. Malinga was a diminished force through the 2015 World Cup and became significantly slower in his later years, in which he also put on weight. ", "He stepped down as T20 captain ahead of Sri Lanka's 2016 World T20 campaign, again owing to a chronic knee injury, this time in his left leg. He has at times suggested that his career hangs in the balance as a result of these injuries. At others he has said he wishes to play on for another few years. "], "t20_bowling_innings": "68", "t20_highest_score": "27", "t20_bowling_5W": "1", "t20_stumps": "18", "t20_SR": "77.65", "t20_batting_average": "5.61", "t20_bowling_average": "19.77", "name": "Lasith Malinga", "t20_catches": "3", "t20_bowling_runs": "1780", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "73", "t20_bowling_SR": "16.1"},
{"t20_batting_innings": "6", "t20_50": "0", "t20_bowling_4W": "0", "t20_bowling_matches": "17", "t20_batting_matches": "17", "t20_BBM": "5/3", "player_ifo": ["{'Born':'\nMarch 19, 1978, Kurunegala '}", "{'Current age':'40 years 88 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Bowler'}", "{'Batting style':'Left-hand bat'}"], "t20_BBI": "5/3", "t20_batting_NO": "3", "t20_bowling_econ": "6.13", "t20_bowling_balls": "365", "t20_bowling_10W": "0", "t20_BF": "12", "t20_bowling_wickets": "18", "profile": ["\nRangana Herath is an orthodox left-arm spinner who has taken over from Muttiah Muralitharan as Sri Lanka's main wicket-taking bowler in Tests. As a left-arm spinner, his strengths are his accuracy and his ability to bowl long spells, but to that he has added a 'mystery' ball, a delivery that is quicker and darts back into the right-hander.  \n", "In his early years, he was seen as a support act to Muralitharan, though he had his moments to savour: against Pakistan in 2009, his 4 for 15 got Sri Lanka an improbable win, as Pakistan were bundled out for 117 chasing 168. Most of the time during that period, though, his role was to bowl long spells block the runs and build pressure on the batsmen, allowing Murali to work his magic from the other end.", "Since Murali's retirement, Herath has been Sri Lanka's go-to bowler. His unrelenting accuracy, and his ability to subtly vary his pace and flight have made him a potent force even overseas, where conditions don't always favour spin bowling. On Sri Lanka's tour to South Africa in 2011-12, Herath's match haul of 9 for 128 helped the team to their first Test win in South Africa. Next season he also had an impressive tour of Australia, bowling long spells, taking wickets and keeping the runs in check when the fast bowlers struggled to exercise any sort of control. He was the leading wicket-taker in Tests in 2012, with 60 at an average of 23.61, thus proving conclusively that he had broken out of Murali's shadow, and was among the best left-arm spinners going around.", "\n"], "t20_bowling_innings": "17", "t20_highest_score": "3", "t20_bowling_5W": "1", "t20_stumps": "0", "t20_SR": "66.66", "t20_batting_average": "2.66", "t20_bowling_average": "20.72", "name": "Rangana Herath", "t20_catches": "0", "t20_bowling_runs": "373", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "8", "t20_bowling_SR": "20.2"},
{"t20_batting_innings": "5", "t20_50": "0", "t20_bowling_4W": "0", "t20_bowling_matches": "8", "t20_batting_matches": "8", "t20_BBM": "2/18", "player_ifo": ["{'Born':'\nSeptember 7, 1984, Colombo '}", "{'Current age':'33 years 281 days'}", "{'Major teams':'Sri Lanka,'}", "{'Also known as':'Fara'}", "{'Playing role':'Allrounder'}"], "t20_BBI": "2/18", "t20_batting_NO": "1", "t20_bowling_econ": "7.37", "t20_bowling_balls": "162", "t20_bowling_10W": "0", "t20_BF": "43", "t20_bowling_wickets": "7", "profile": ["\nFarveez Maharoof is a fast-bowling allrounder who bowls lively seamers from an upright, open-chested action. Sri Lanka's selectors, impressed by his performances as under-19 captain, fast-tracked him into the national squad for the Zimbabwe tour in April-May 2004 as they looked towards the future. Faced with a weak opposition, Maharoof picked up a bunch of wickets, but then came up against better competitors during the Asia Cup. He performed reasonably well, and made a mark with his swinging deliveries when South Africa came visiting. He had worked his way up through the representative ranks, playing for the Sri Lanka Under-15s, Under-17s and under-19s, and led the Under-19 team on four tours, including the 2004 Youth World Cup in Bangladesh.  \n", "He enjoyed a prolific school career for Wesley College, with a highest score of 243 and best bowling figures of 8 for 20. Maharoof has not had too many opportunities in Test cricket but was a limited-overs regular for a good half-decade.", "A mean display during the 2004 ICC Champions Trophy in England, when he exploited the end-of-summer conditions expertly, indicated he could be especially useful when Sri Lanka play in seamer-friendly conditions. A useful series with bat and ball against Pakistan in early 2006 suggested he was ready to push on, but his bowling failed to impress on the tour of England - taking only one wicket in three Tests - in conditions that should have suited him.", "Then came an astonishing display at the Champions Trophy in India when his 6 for 14 skittled West Indies out for 80. He performed creditably with bat and ball for the Delhi Daredevils in the IPL's first season", "Maharoof was in and out of Sri Lanka's squad till 2012, when he was dropped following the Asia Cup in Bangladesh. He made a surprise comeback in 2016, when the selectors recalled him for the limited-overs leg of their tour to Ireland and England."], "t20_bowling_innings": "8", "t20_highest_score": "13*", "t20_bowling_5W": "0", "t20_stumps": "2", "t20_SR": "76.74", "t20_batting_average": "8.25", "t20_bowling_average": "28.42", "name": "Farveez Maharoof", "t20_catches": "1", "t20_bowling_runs": "199", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "33", "t20_bowling_SR": "23.1"},
{"t20_batting_innings": "38", "t20_50": "1", "t20_bowling_4W": "-", "t20_bowling_matches": "43", "t20_batting_matches": "43", "t20_BBM": "-", "player_ifo": ["{'Born':'\nFebruary 24, 1987, Kandy '}", "{'Current age':'31 years 111 days'}", "{'Major teams':'Sri Lanka,'}", "{'Nickname':'Kapu'}", "{'Playing role':'Middle-order batsman'}"], "t20_BBI": "-", "t20_batting_NO": "7", "t20_bowling_econ": "-", "t20_bowling_balls": "-", "t20_bowling_10W": "-", "t20_BF": "591", "t20_bowling_wickets": "-", "profile": ["\nAmong the more frustrating players to have represented Sri Lanka in recent years, Chamara Kapugedara had ample opportunities at the top level between 2006 and 2012, but did not manage to nail down a place. That he is a rare talent has never been in doubt, but in international cricket, that raw ability has not usually translated into runs. Perhaps his fans will argue that he was asked to bat too low in limited-overs cricket to have a major impact on the game. Nevertheless, his returns were modest, and his place in the side became untenable, for a few years at least.  \n", "Kapugedara has, however, enjoyed something of a renaissance in T20 cricket, after he was picked in the national side again in 2015. He impressed initially during his second coming, but another round of mixed results saw him in and out of the team. Despite having played top-level cricket for over a decade, he is still relatively young, and it is hoped he may yet come good as a consistent player. ", "Naturally aggressive, and capable of clearing the boundary, Kapugedara had been one of the few genuinely exciting batsmen the selectors unearthed from Sri Lanka's Under-19 set-up. From the age of 11, when he first turned out for Dharmaraja College in Kandy, Kapugedera had hardly wasted an opportunity to push himself up the ladder. He had captained all the junior school sides from the U-13 to the first XI. Following a prolific 2003-04 season, where he scored over 1000 runs, he was picked for the U-19 tour to Pakistan the following year and had excelled with a stunning knock of 131 in a one-dayer against the world champions. ", "It was an innings he had rated as one of his best although he batted equally well for 70 in his first game for Sri Lanka A against the strong New Zealand A team in 2005. The selectors, desperate to unearth new talent, eventually gambled on an early promotion and fast-tracked him into the national squad after several glowing reports from development coaches.", "Kapugedera's father, also a former Dharmaraja cricketer, provided early coaching and all the encouragement he needed to develop. David Karunaratne (his first coach) and Sumithra Warnakulasuriya (his U-19 coach) also played important roles in shaping Kapugedera's career. He was first picked in the national squad against India in November but pulled out of the tour with an injury. However, he made his ODI debut, aged just 18, against Australia in Perth in 2006, immediately impressing with his composure. \n", "\n"], "t20_bowling_innings": "-", "t20_highest_score": "50", "t20_bowling_5W": "-", "t20_stumps": "17", "t20_SR": "118.95", "t20_batting_average": "22.67", "t20_bowling_average": "-", "name": "Chamara Kapugedera", "t20_catches": "25", "t20_bowling_runs": "-", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "703", "t20_bowling_SR": "-"},
{"t20_batting_innings": "55", "t20_50": "9", "t20_bowling_4W": "0", "t20_bowling_matches": "55", "t20_batting_matches": "55", "t20_BBM": "-", "player_ifo": ["{'Born':'\nMay 27, 1977, Colombo '}", "{'Current age':'41 years 19 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Batsman'}", "{'Batting style':'Right-hand bat'}"], "t20_BBI": "-", "t20_batting_NO": "8", "t20_bowling_econ": "8.00", "t20_bowling_balls": "6", "t20_bowling_10W": "0", "t20_BF": "1121", "t20_bowling_wickets": "0", "profile": ["\nA prolific, elegant and utterly classy batsman with a huge appetite for runs, and a calm yet authoritative captain - those are the qualities that best describe Mahela Jayawardene. His sheer quality as a batsman was never in doubt even when he just entered the international scene, but for Jayawardene the biggest challenge has been to justify all the early hype. With over 10,000 runs in both Tests and ODIs - and a captaincy stint that included a World Cup final appearance - it can safely be said that he has met that challenge more than adequately. \n", "Blessed with excellent hand-eye coordination and a fine technique, Jayawardene scores his runs all around the wicket. Among his favourite strokes are the languid cover-drive - often with minimal footwork but precise placement and timing - and the wristy flick off his legs, but there are several others he plays with equal felicity. The most memorable are the cuts and dabs he plays behind the stumps, mostly off spinners, but also against quick bowling, when bat makes contact with ball delightfully late. Apart from his artistry, what stands out about his batting is his hunger for big scores, most apparent in his record 624-run partnership with Kumar Sangakkara, but also in the regularity with which he notches up Test double-hundreds. And his century against Zimbabwe in the World Twenty20 in 2010 was a shining example of traditional methods succeeding in a new format.", "Jayawardene is easily one of the most elegant batsmen of his generation, but the major drawback in his career is his relative lack of success in overseas conditions. His averages in Australia, England, South Africa and New Zealand are all less than 35, but at home he averages more than 60.", "In the second half of his career, Jayawardene grew into an astute captain who read the game well and wasn't afraid to take risks. Under him, Sri Lanka shed their diffident approach, winning Tests in England and New Zealand, and - in what was Jayawardene's greatest achievement as captain - reached the final of the 2007 World Cup. He quit captaincy in February 2009, but agreed to a second stint, taking over from Tillakaratne Dilshan after the tour to South Africa in 2011-12, but resigned again after a year, handing the reins to Angelo Mathews. ", "His limited overs batting has improved with age, and an increasing stroke repertoire has seen Jayawardene become almost as impressive an innovator at the crease, as he is a technician. An unbeaten 103 from 88 balls in the 2011 World Cup final made plain his limited  overs prowess, and marked him out as a big-match player, having already made a century in the semi-final of the same tournament four years ago. \n"], "t20_bowling_innings": "1", "t20_highest_score": "100", "t20_bowling_5W": "0", "t20_stumps": "17", "t20_SR": "133.18", "t20_batting_average": "31.76", "t20_bowling_average": "-", "name": "Mahela Jayawardene", "t20_catches": "33", "t20_bowling_runs": "8", "t20_100": "1", "country": ["Sri Lanka"], "t20_batting_runs": "1493", "t20_bowling_SR": "-"},
{"t20_batting_innings": "1", "t20_50": "0", "t20_bowling_4W": "-", "t20_bowling_matches": "1", "t20_batting_matches": "1", "t20_BBM": "-", "player_ifo": ["{'Born':'\nOctober 25, 1973, Colombo '}", "{'Current age':'44 years 233 days'}", "{'Major teams':'Sri Lanka,'}", "{'Batting style':'Left-hand bat'}", "{'Bowling style':'Right-arm offbreak'}"], "t20_BBI": "-", "t20_batting_NO": "0", "t20_bowling_econ": "-", "t20_bowling_balls": "-", "t20_bowling_10W": "-", "t20_BF": "7", "t20_bowling_wickets": "-", "profile": ["\nArnold's ability to adapt his game to the situation makes him an ideal No.6 in limited overs cricket and an unselfish approach explains the high esteem in which he is held by teammates. A cool head under pressure helps when chasing and he adds great value in field with a safe pair of hands. He can also bowl useful offbreaks. \n", "A tall, angular left-hander and a patient accumulator, Arnold began his Test career as an opener but despite solid scores then, and on his recall for the Asian Test Championship two years later, he lost out to Marvan Atapattu as Sanath Jayasuriya's partner. Short of runs by late 2000, he dropped into the lower middle order. When a loss of form and confidence from Jayasuriya gave Arnold another chance at the top of the order in 2002, he scored 62 and 109 in a valiant rearguard at Old Trafford. Failure in the series that followed left him on the sidelines for long periods after the 2003 World Cup but Arnold made his way back into the team for the home series against Australia. Despite making 51 not out in his last ODI against Zimbabwe, Arnold was dropped from the ODI and Test teams in July 2004. The seven-man Ashantha de Mel selection committee wanted to blood new talent and Arnold's future looked bleak for a while. But he worked hard on his game in the nets and started to score heavily in domestic cricket. Finally, with his replacements failing to impress, he won a recall for the New Zealand tour in December 2004.  However, pressure from the young brigade - the likes of Tillakaratne Dilshan - left him fighting for his place. His Test role went first but, after a poor tour of England in 2006 (following some promising efforts in Australia), he was dumped. But experience can never be discounted in major tournaments and he found a spot in the 2007 World Cup squad. ", "Arnold retired after the World Cup final and joined the unofficial Indian Cricket League, playing for the Chennai Superstars and ICL World XI. A ban on he and four other Sri Lankans was lifted in September 2008, meaning Arnold was free to play domestic cricket back home. He has also dabbled in radio commentary. \n", " September 2008"], "t20_bowling_innings": "-", "t20_highest_score": "7", "t20_bowling_5W": "-", "t20_stumps": "0", "t20_SR": "100.00", "t20_batting_average": "7.00", "t20_bowling_average": "-", "name": "Russel Arnold", "t20_catches": "0", "t20_bowling_runs": "-", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "7", "t20_bowling_SR": "-"},
{"t20_batting_innings": "244", "t20_50": "34", "t20_bowling_4W": "", "t20_bowling_matches": "156", "t20_batting_matches": "156", "t20_BBM": "", "player_ifo": ["{'Born':'\nJanuary 15, 1983, Colombo '}", "{'Current age':'35 years 151 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Allrounder'}", "{'Batting style':'Left-hand bat'}"], "t20_BBI": "6/37", "t20_batting_NO": "33", "t20_bowling_econ": "3.42", "t20_bowling_balls": "15270", "t20_bowling_10W": "1", "t20_BF": "", "t20_bowling_wickets": "322", "profile": ["\nJeewan Mendis comes from a cricketing family, with his father Jagath and brother Tharindu also playing for his school, St Thomas' College. As a youth cricketer, Jeewan won several prestigious awards, including the Schoolboy Cricketer of the Year in 2001, the Man-of-the-Tournament awards in the Under-17 Asia Cup in Pakistan and the 2001 U-19 World Cup in New Zealand, where he bowled a record-breaking spell of 7 for 19 against Zimbabwe. However, during his six years for SSC, he hardly got an\nopportunity to bowl his legspinners, but his move to Tamil Union in 2008-09 opened the doors for him to display his all-round talent.  \n", "In the recently concluded domestic season, Mendis won the Man-of-the-Tournament and Man-of-the-Final awards, scoring 450 runs and taking 26 wickets to help Tamil\nUnion emerge the Premier limited-overs champions. In the Premier League, he\naccumulated 600 runs and captured 36 wickets to win the Player-of-the-Tournament prize once again - a unique double underlying the fact that he is a cricketer suitable for all versions of the game. Mainly a top-order batsman at No. 3 or 4 from his school days, Mendis honed his spin-bowling skills under the national spin bowling coach, Piyal Wijetunge. Mendis says batsmen find it difficult to read his leg spin or googly because of the way he grips the ball. An outstanding fielder, Mendis believes he is at his peak and selection to the Sri Lanka A team for the upcoming tri-nation series against Canada and Holland is one step towards achieving his life-long ambition of representing his country.", " ", " January 2010 \n"], "t20_bowling_innings": "", "t20_highest_score": "206*", "t20_bowling_5W": "15", "t20_stumps": "124", "t20_SR": "", "t20_batting_average": "35.34", "t20_bowling_average": "27.09", "name": "Jeevan Mendis", "t20_catches": "", "t20_bowling_runs": "8726", "t20_100": "19", "country": ["Sri Lanka"], "t20_batting_runs": "7458", "t20_bowling_SR": "47.4"},
{"t20_batting_innings": "79", "t20_50": "13", "t20_bowling_4W": "0", "t20_bowling_matches": "80", "t20_batting_matches": "80", "t20_BBM": "2/4", "player_ifo": ["{'Born':'\nOctober 14, 1976, Kalutara '}", "{'Current age':'41 years 244 days'}", "{'Major teams':'Sri Lanka,'}", "{'Also known as':'Tuwan Mohamad Dilshan'}", "{'Playing role':'Allrounder'}"], "t20_BBI": "2/4", "t20_batting_NO": "12", "t20_bowling_econ": "7.27", "t20_bowling_balls": "258", "t20_bowling_10W": "0", "t20_BF": "1567", "t20_bowling_wickets": "9", "profile": ["\nWith his relentless aggression, strong wrists and natural timing, Tillakaratne Dilshan is one of the most exciting batsmen in the game today. He is technically sound, but, much like Virender Sehwag, he uses the defensive option only as a last resort, after all the attacking alternatives have been explored. He loves to make room and thrash the ball through the off side, but the stroke that bears his signature more than any other is the one he developed for the 2009 ICC World Twenty20 - the eponymously named \"Dilscoop\" shot over his head, which confounded bowlers and experts alike. \n", "In fact, 2009 was a watershed year in his career, and a huge factor was his move up the batting order to open the innings in all three forms of the game. It was a move that proved his making, as he exploited attacking fields and amassed huge scores in all formats: he scored 11 international hundreds in the year, and won the World Twenty20 Player of the Series prize.", "Dilshan's abundant talent was never in doubt from the moment he made his debut, but he went through several early troughs, most notably when he was dropped from 2001 to 2003. Having burst onto the international scene with an unbeaten 163 against Zimbabwe in his first series in November 1999, Dilshan's career remained largely unfulfilled until he cemented his place as one of the most destructive openers in the modern era. Add his electric fielding, especially at backward point, and his underrated offspin, and Dilshan is a quality package. In 2011 he was named Sri Lanka's captain, after the resignation of Kumar Sangakkara, but his reign lasted less than a year, with Mahela Jayawardene replacing him after Sri Lanka's tour to South Africa in 2011-12. Like his team, Dilshan had had a poor run of form while he was captain, but his batting enjoyed a revival after being relieved of leadership, particularly in ODI cricket, where he was 2012's second-heaviest scorer, with 1119 runs. \n", " "], "t20_bowling_innings": "25", "t20_highest_score": "104*", "t20_bowling_5W": "0", "t20_stumps": "31", "t20_SR": "120.54", "t20_batting_average": "28.19", "t20_bowling_average": "34.77", "name": "Tillakaratne Dilshan", "t20_catches": "33", "t20_bowling_runs": "313", "t20_100": "1", "country": ["Sri Lanka"], "t20_batting_runs": "1889", "t20_bowling_SR": "28.6"},
{"t20_batting_innings": "1", "t20_50": "0", "t20_bowling_4W": "0", "t20_bowling_matches": "2", "t20_batting_matches": "2", "t20_BBM": "1/21", "player_ifo": ["{'Born':'\nMarch 20, 1981, Matale '}", "{'Current age':'37 years 87 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Bowler'}", "{'Batting style':'Right-hand bat'}"], "t20_BBI": "1/21", "t20_batting_NO": "1", "t20_bowling_econ": "10.16", "t20_bowling_balls": "36", "t20_bowling_10W": "0", "t20_BF": "3", "t20_bowling_wickets": "1", "profile": ["\nWelegedara was a late starter to cricket. He learnt to play the game for St. Thomas' College in Matale at the age of 17, but he made rapid progress performing in provincial matches. When he came to Colombo he was selected as one of 15 probables by Daryl Foster, the Australian fast bowling coach, for the Sri Lanka Pace Academy headed by former Sri Lanka fast bowler Rumesh Ratnayake in 2000. Soon afterwards he was sent to the MRF Pace Academy in Chennai to further develop his skills. Playing for Moors SC since 2002 he bowled his club to the Premier league title in 2002-03 capturing 34 wickets (avg. 24.14) in 13 matches. But his career-best performance came the following season when he took a match haul of nine wickets against Colombo Cricket Club to steer Moors to a comprehensive ten-wicket win. He took the majority of his wickets bowling inswing and trapping the batsmen leg before. Welegedera toured Sharjah with the Sri Lanka Academy side and took seven wickets against UAE, which earned him selection for Sri Lanka A. But he suffered an ankle injury and had to be operated in Australia. The injury kept him out of cricket for 1 ½ years, but his Test debut finally arrived against England, in Galle, during the 2007-08 series.  \n", "Often looked to as the leader of the pace attack, after it became apparent that Lasith Malinga would not return to Tests, Welegedara has had a mixed time at the top level. He improved considerably throughout 2011, and then turned in his best performance for Sri Lanka at the end of the year, as he took 5 wickets for 52 in the first innings in Durban, to help set up Sri Lanka's maiden Test win in South Africa. ", "He has since been plagued by various injuries, and his absences have seen others make claims for the pace spearhead role in the past year. ", " July 2008"], "t20_bowling_innings": "2", "t20_highest_score": "2*", "t20_bowling_5W": "0", "t20_stumps": "0", "t20_SR": "66.66", "t20_batting_average": "-", "t20_bowling_average": "61.00", "name": "Chanaka Welegedara", "t20_catches": "0", "t20_bowling_runs": "61", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "2", "t20_bowling_SR": "36.0"},
{"t20_batting_innings": "183", "t20_50": "28", "t20_bowling_4W": "", "t20_bowling_matches": "126", "t20_batting_matches": "126", "t20_BBM": "", "player_ifo": ["{'Born':'\nSeptember 26, 1981, Colombo '}", "{'Current age':'36 years 262 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Allrounder'}", "{'Batting style':'Left-hand bat'}"], "t20_BBI": "6/62", "t20_batting_NO": "20", "t20_bowling_econ": "3.21", "t20_bowling_balls": "14238", "t20_bowling_10W": "0", "t20_BF": "", "t20_bowling_wickets": "285", "profile": [], "t20_bowling_innings": "", "t20_highest_score": "122*", "t20_bowling_5W": "5", "t20_stumps": "132", "t20_SR": "", "t20_batting_average": "30.04", "t20_bowling_average": "26.74", "name": "Muthumudalige Pushpakumara", "t20_catches": "", "t20_bowling_runs": "7621", "t20_100": "7", "country": ["Sri Lanka"], "t20_batting_runs": "4897", "t20_bowling_SR": "49.9"},
{"t20_batting_innings": "30", "t20_50": "4", "t20_bowling_4W": "0", "t20_bowling_matches": "31", "t20_batting_matches": "31", "t20_BBM": "3/21", "player_ifo": ["{'Born':'\nJune 30, 1969, Matara '}", "{'Current age':'48 years 350 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Allrounder'}", "{'Batting style':'Left-hand bat'}"], "t20_BBI": "3/21", "t20_batting_NO": "3", "t20_bowling_econ": "7.37", "t20_bowling_balls": "371", "t20_bowling_10W": "0", "t20_BF": "487", "t20_bowling_wickets": "19", "profile": ["\nIt's hard to imagine that for the first half-decade of his career, Sanath Jayasuriya was considered a bowler who could bat a bit. Think of him now and you think of forearms straight out of a smithy, shots hammered through point and cover and scythes over the leg side. You recall a man who could score equally briskly in every form of the game, who slashed and burned his way through bowling attacks. As with anyone who relied so much on extraordinary hand-eye coordination, there were troughs and lean times, but just as the obit writers got busy, he would produce another innings of supreme power. The bowling, always canny and relying more on variations in pace than sharp turn, became the supporting act, though 440 international wickets should tell you that he was pretty adept at what he did. \n", "Following Mark Greatbatch's success at the 1992 World Cup, most teams were rethinking the way they approached the one-day game and Jayasuriya, who had trawled the lower reaches of the middle order till then, had his first stint as opener during the Hero Cup in India in 1993. It was only during a home series against Pakistan the following year that he established himself in the role and by the time the World Cup rolled around 18 months later, he had already chalked up his first century in whites, a frenetic stroke-filled effort in Adelaide. ", "The years that followed were both prolific and successful. People remember Aravinda de Silva's magical innings from the semi-final and final of  the 1996 World Cup but it was Jayasuriya's withering assaults that deflated India in Delhi and England in the last eight. Soon after, he began to exact as heavy a toll on Test attacks, scoring at such a pace that Muttiah Muralitharan and friends had ample time to work their way through opposition batsmen.", "After Arjuna Ranatunga's ouster, there was a four-year stint as captain that ended with a semi-final appearance at the 2003 World Cup, and just as the whispers grew about diminishing returns with the bat, he had one of his most successful years in 2004. There was a retirement announcement  in 2006, but he was back within weeks, and the walk off the Test stage came only 18 months later, after a typically cavalier innings in Kandy.", "The one-day flame continued to burn bright, and took Sri Lanka to another World Cup final in 2007, and he was instrumental in the Asia Cup win of 2008, a couple of months after it had seemed that the selectors' axe had fallen for the final time. The Indian Premier League gave him a new platform to showcase his big-hitting talent, but failure to replicate the success of the first season in subsequent campaigns was the surest sign that time had finally caught up with a man who was still pounding out one-day hundreds at the age of 39. ", "His election as a Member of Parliament in April 2010 and his subsequent failure at the World Twenty20 suggested that his international career may be at an end, but he made the longlist for the 30-man squad for the 2011 World Cup, before being recalled to the one-day side for the series in England two weeks shy of his 42nd birthday."], "t20_bowling_innings": "24", "t20_highest_score": "88", "t20_bowling_5W": "0", "t20_stumps": "4", "t20_SR": "129.15", "t20_batting_average": "23.29", "t20_bowling_average": "24.00", "name": "Sanath Jayasuriya", "t20_catches": "23", "t20_bowling_runs": "456", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "629", "t20_bowling_SR": "19.5"},
{"t20_batting_innings": "52", "t20_50": "2", "t20_bowling_4W": "13", "t20_bowling_matches": "43", "t20_batting_matches": "43", "t20_BBM": "11/136", "player_ifo": ["{'Born':'\nJune 23, 1993, Colombo '}", "{'Current age':'24 years 357 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Bowler'}", "{'Batting style':'Right-hand bat'}"], "t20_BBI": "7/71", "t20_batting_NO": "10", "t20_bowling_econ": "3.09", "t20_bowling_balls": "7941", "t20_bowling_10W": "2", "t20_BF": "1055", "t20_bowling_wickets": "193", "profile": ["\nAn accurate left-arm spinner for Ragama Cricket Club, Amila Aponso emerged as one of Sri Lanka's better finger-spinning prospects, after successful first-class seasons in 2015 and 2016. A graduate of St. Sebastian's College, Moratuwa, Aponso began his first-class career at Colts Cricket Club, but it was at Ragama that he rose to prominence. He claimed 31 first-class wickets at an average of 20.9 in the 2015 season, and was rewarded with a place in the Sri Lanka A squad to New Zealand, later that year. \n", " \n \nIn 2016, his domestic returns continued to improve. His 47 scalps at 20.97 placed him third on the wicket-takers' table. He was part of Sri Lanka's Development Squad to South Africa a few months later, and continued to impress, particularly in the four-day match against a South Africa Emerging XI in Potchefstroom, where he took 13 wickets for 207 runs. A few days later, Aponso was called up to Sri Lanka's ODI squad.", "\n"], "t20_bowling_innings": "76", "t20_highest_score": "68", "t20_bowling_5W": "10", "t20_stumps": "19", "t20_SR": "47.96", "t20_batting_average": "12.04", "t20_bowling_average": "21.22", "name": "Amila Aponso", "t20_catches": "9", "t20_bowling_runs": "4097", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "506", "t20_bowling_SR": "41.1"},
{"t20_batting_innings": "7", "t20_50": "0", "t20_bowling_4W": "0", "t20_bowling_matches": "18", "t20_batting_matches": "18", "t20_BBM": "3/19", "player_ifo": ["{'Born':'\nJuly 19, 1979, Colombo '}", "{'Current age':'38 years 331 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Bowler'}", "{'Batting style':'Right-hand bat'}"], "t20_BBI": "3/19", "t20_batting_NO": "2", "t20_bowling_econ": "7.36", "t20_bowling_balls": "378", "t20_bowling_10W": "0", "t20_BF": "27", "t20_bowling_wickets": "18", "profile": ["\nWhen Fernando burst onto the international scene, young and raw, he soon inspired hope that he would be the long-term replacement for Chaminda Vaas as the cutting edge of the pace attack. He has natural pace - six months after his debut he was timed at 91.9 mph in Durban - hits the pitch hard and moves the ball off the seam. During the early years he paid for his inconsistent line and length, but then worked hard with Rumesh Ratnayake in the Fast Bowling Unit and became more reliable. He also learnt the art of reverse swing and developed a well-disguised slower ball. His career, though, has been plagued with injury. He suffered his second stress fracture of the back in 12 months in January 2004 and missed the entire home series against Australia. However, he has now been slowly nursed back to full fitness and after playing for Sri Lanka A in New Zealand, he has won his place back in the squad. He struggled to hold down a regular spot, especially in the Test team, and was again struck by injury in 2005. However, he fought his way back  for the one-day leg of the tour of England and, although he is having to look over his shoulder at the young seamers, has forced off the attention of Nuwan Zoysa for a place in the 2007 World Cup squad. But he remains a wild card that can either win or lose a match in one spell. Worcestershire thought of him as a winner, however, when they signed him for the final few weeks of their Championship campaign in 2008.\n", " September 2008 \n"], "t20_bowling_innings": "18", "t20_highest_score": "21", "t20_bowling_5W": "0", "t20_stumps": "3", "t20_SR": "92.59", "t20_batting_average": "5.00", "t20_bowling_average": "25.77", "name": "Dilhara Fernando", "t20_catches": "0", "t20_bowling_runs": "464", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "25", "t20_bowling_SR": "21.0"},
{"t20_batting_innings": "5", "t20_50": "0", "t20_bowling_4W": "0", "t20_bowling_matches": "10", "t20_batting_matches": "10", "t20_BBM": "2/26", "player_ifo": ["{'Born':'\nMarch 10, 1987, Matara '}", "{'Current age':'31 years 97 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Bowler'}", "{'Batting style':'Right-hand bat'}"], "t20_BBI": "2/26", "t20_batting_NO": "3", "t20_bowling_econ": "9.52", "t20_bowling_balls": "184", "t20_bowling_10W": "0", "t20_BF": "8", "t20_bowling_wickets": "7", "profile": ["\nA right-arm fast bowler, Suranga Lakmal was first spotted by Sri Lanka Cricket's fast bowling coaches while still a student at Debarawewa Central. They closely monitored his progress to Richmond College and then to the Tamil Union team whom he represents in domestic cricket. What impressed the coaches about Lakmal was his height and ability to get bounce and swing at a tender age. Despite his natural ability, Lakmal had one big deficiency in that he lacked the stamina to bowl long spells and on occasions he did, he regularly fell ill. The lack of nutrition was quite common with fast bowlers coming from outside Colombo and soon after Lakmal was inducted into the academy, the coaches worked on developing his stamina. Good performances with Sri Lanka A saw him break into the national ODI side. He was one of three players marked for the future by Chandika Hathurusingha in 2008 when he coached the A side. ", " ", " January 2010 \n"], "t20_bowling_innings": "10", "t20_highest_score": "5*", "t20_bowling_5W": "0", "t20_stumps": "3", "t20_SR": "87.50", "t20_batting_average": "3.50", "t20_bowling_average": "41.71", "name": "Suranga Lakmal", "t20_catches": "0", "t20_bowling_runs": "292", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "7", "t20_bowling_SR": "26.2"},
{"t20_batting_innings": "1", "t20_50": "0", "t20_bowling_4W": "0", "t20_bowling_matches": "1", "t20_batting_matches": "1", "t20_BBM": "-", "player_ifo": ["{'Born':'\nSeptember 18, 1991, Colombo '}", "{'Current age':'26 years 270 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Bowler'}", "{'Batting style':'Right-hand bat'}"], "t20_BBI": "-", "t20_batting_NO": "0", "t20_bowling_econ": "8.00", "t20_bowling_balls": "12", "t20_bowling_10W": "0", "t20_BF": "2", "t20_bowling_wickets": "0", "profile": ["\nA left-arm quick from Moratuwa, Vishwa Fernando has been earmarked for national duty, thanks largely to the skiddy pace he generates from a whippy action. Having made his first-class debut in 2012, Fernando showed early potential, claiming 26 wickets in his maiden season. \n", " ", " ", "Fernando's bowling, though, was always thought to be better than his figures suggest. His first foray into the national squad was based on little more than a selector's hunch, and a desire to blood left-arm quicks, who are in short supply in Sri Lanka's domestic cricket. Fernando was named in in Sri Lanka's Test squad to the UAE in 2014, before also traveling to Bangladesh with the side soon after. He did not make an international debut, however, and returned home to play out a modest series against the visiting England A side.", " ", "\nHe would get another break in 2015, when he was named in Sri Lanka's Test squad for the series against India, in August. This time, his selection was backed by wickets. Fernando had been the most penetrative quick in the 2014-15 Premier League Tournament, having claimed 40 scalps at an average of 21.97.\n"], "t20_bowling_innings": "1", "t20_highest_score": "2", "t20_bowling_5W": "0", "t20_stumps": "0", "t20_SR": "100.00", "t20_batting_average": "2.00", "t20_bowling_average": "-", "name": "Vishwa Fernando", "t20_catches": "0", "t20_bowling_runs": "16", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "2", "t20_bowling_SR": "-"},
{"t20_batting_innings": "45", "t20_50": "4", "t20_bowling_4W": "-", "t20_bowling_matches": "52", "t20_batting_matches": "52", "t20_BBM": "-", "player_ifo": ["{'Born':'\nNovember 18, 1989, Balapitiya '}", "{'Current age':'28 years 209 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Wicketkeeper batsman'}", "{'Batting style':'Right-hand bat'}"], "t20_BBI": "-", "t20_batting_NO": "3", "t20_bowling_econ": "-", "t20_bowling_balls": "-", "t20_bowling_10W": "-", "t20_BF": "713", "t20_bowling_wickets": "-", "profile": ["\nDinesh Chandimal is among the most promising young batsman going around in Sri Lankan cricket. A technically sound batsman with strokes all around the wicket, Chandimal also stands out because of the maturity he shows at the crease and his temperament to build and pace an innings. \n", "He made his international debut when only 21, and impressed almost immediately, scoring 111 in his second ODI, against India in the 2010 triangular series in Zimbabwe. Four innings later, he made another century, this time against England at Lord's, but his stocks rose significantly in 2012, when he performed superbly in ODIs on successive tours to South Africa and Australia. In conditions he wouldn't have been used to, Chandimal occupied the crucial No.4 slot and revelled in the responsibility, scoring consistently. In 16 ODI innings in those two series, he aggregated 630 runs, including six fifties. He was equally impressive on his Test debut too, scoring fifties in each innings in Durban as Sri Lanka won their first Test in South Africa. ", "A dip in his limited overs form, especially at home, saw Chandimal dropped from the side during the latter half of 2012, though he remained in the Sri Lanka squad for all three formats. He returned to the Test side at the SCG for the New Year Test, and hit an unbeaten 67, batting alongside the tail. Six weeks later he became Sri Lanka's youngest ever captain, at 23, when he was handed the reins of Sri Lanka's top-ranked Twenty20, and was also named Angelo Mathews' deputy in Tests and ODIs. He celebrated his elevation with back-to-back Test hundreds against Bangladesh at home. ", "Chandimal's rise to the national team came after consistent performances with bat and gloves at age-level cricket. That included an attacking century against India Under-19s in August 2007 and an unbeaten 112 in the tri-nation series against England U-19s the following year earned him a call-up to the squad for the U-19 World Cup in Malaysia in 2008.", "Shortly after completing a prolific season for Colombo's Ananda College, Chandimal was invited to join Nondescripts Cricket Club by Kumar Sangakkara. Chandimal was only 19 when scored his maiden first-class century against New Zealand in 2009, representing a Sri Lanka Cricket Development XI in two three-day practice matches against the likes of Chris Martin, Darryl Tuffey, Ian O'Brien, Jacob Oram and Daniel Vettori. He was among the leading run-getters in Sri Lanka's Interprovincial Twenty20 competition, and won a call-up to the national side for the ICC World Twenty20 in 2010. Soon after, the international opportunities followed, and Chandimal has made the most of them.", "\n"], "t20_bowling_innings": "-", "t20_highest_score": "58", "t20_bowling_5W": "-", "t20_stumps": "28", "t20_SR": "103.50", "t20_batting_average": "17.57", "t20_bowling_average": "-", "name": "Dinesh Chandimal", "t20_catches": "15", "t20_bowling_runs": "-", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "738", "t20_bowling_SR": "-"},
{"t20_batting_innings": "64", "t20_50": "2", "t20_bowling_4W": "0", "t20_bowling_matches": "73", "t20_batting_matches": "73", "t20_BBM": "3/24", "player_ifo": ["{'Born':'\nApril 3, 1989, Colombo '}", "{'Current age':'29 years 73 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Allrounder'}", "{'Batting style':'Left-hand bat'}"], "t20_BBI": "3/24", "t20_batting_NO": "21", "t20_bowling_econ": "9.10", "t20_bowling_balls": "1006", "t20_bowling_10W": "0", "t20_BF": "666", "t20_bowling_wickets": "50", "profile": ["\nA bustling right-arm seamer and sporadically effective left-handed hitter, Thisara Perera has been been in Sri Lanka's short-format sides since 2010. Bowling is ostensibly Perera's major skill but, often deployed in the lower-middle order, he is also capable of delivering furious finishes to an innings. Perera is particularly severe on spin, which has led to his being used as a pinch-hitter through the middle overs, but he has at times also been weak to quality pace bowling.  \n", "He is the kind of player for whom form in one discipline usually bleeds into the other. Dropped for the limited-overs series against South Africa in July 2014, but roared back in the following ODI series against Pakistan, getting his bowling and his hitting in order. He struck 78 runs at a rate of 169.56 and claimed a series-high nine wickets at an average of 10.66. ", "Perera has also done well with bat and ball on previous tours to Australia, and has often been at his best against India, memorably slamming the straight six that completed Sri Lanka's World T20 triumph in 2014. His more recent years have been beset by inconsistency but Perera continues to command a place in the side. He has hat-tricks in both ODIs and T20s.", "Perera began his schooling at St Anthony's, Wattala, before accepting a scholarship to join St Joseph's College. It turned out to be a productive move as he teamed up with Angelo Mathews and produced many noteworthy performances in the thriving schools cricket scene. Perera played a key role in helping his school break the hoodoo in the Battle of the Saints (against St Peters College) that lasted more than 35 years. He received his maiden national call-up during Sri Lanka's tour of India in 2009 as an emergency replacement for Mathews. ", "That quickly led to an IPL contract, as he was bought by Chennai Super Kings for $50,000, and he has been one of the few Sri Lanka players to consistently find employment in the competition.\n"], "t20_bowling_innings": "61", "t20_highest_score": "61", "t20_bowling_5W": "0", "t20_stumps": "29", "t20_SR": "153.15", "t20_batting_average": "23.72", "t20_bowling_average": "30.52", "name": "Thisara Perera", "t20_catches": "51", "t20_bowling_runs": "1526", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "1020", "t20_bowling_SR": "20.1"},
{"t20_batting_innings": "2", "t20_50": "0", "t20_bowling_4W": "0", "t20_bowling_matches": "7", "t20_batting_matches": "7", "t20_BBM": "3/20", "player_ifo": ["{'Born':'\nJanuary 30, 1985, Matara '}", "{'Current age':'33 years 136 days'}", "{'Major teams':'Sri Lanka,'}", "{'Also known as':'Suraj Mohamed'}", "{'Playing role':'Bowler'}"], "t20_BBI": "3/20", "t20_batting_NO": "0", "t20_bowling_econ": "6.61", "t20_bowling_balls": "126", "t20_bowling_10W": "0", "t20_BF": "6", "t20_bowling_wickets": "7", "profile": ["\nA tall offspinner with gentle action, Suraj Randiv has eschewed the mystery balls many of his colleagues deal in and has instead forged a career reliant on flight, dip and, importantly, bounce. The topspinner and the arm ball are his only variations, and even his offbreak is not given to excessive turn.  \n", "He had begun his career as a right-arm fast bowler at junior level, until his school found that they had no spinner in their Under-15 side and he was called on to fill the void. Starting as a part-time bowler, he was soon picking up wickets on a regular basis and started representing Matara SC while still at school. Twenty-three wickets in four matches in the U-23 tournament in 2003-04 did not go unnoticed by Marvan Atapattu and Mahela Jayawardene, who brought him over to SSC. He benefited immensely in the presence of Atapattu and Jayawardene, learning how to bowl under pressure and to different fields. ", "He picked up 55 first-class wickets in 2005-06 but fell away in the next three seasons. However, he struck form again in 2008-09, taking 43 wickets and an injury to Murali before the Galle Test against Pakistan led to a national call-up, and made himself the Test side's second-choice spinner. Though a wonderful fielder and a handy lower order batsman, Randiv has not been able to nail down a place in the limited overs sides, perhaps other slow bowlers have been more committed to developing a wider variety of deliveries, which are more highly valued in the shorter formats. His position in the Test side has lately come under increasing pressure from a talented group of chasing spinners, led by Tharindu  Kaushal.", "\n", " "], "t20_bowling_innings": "7", "t20_highest_score": "6", "t20_bowling_5W": "0", "t20_stumps": "0", "t20_SR": "133.33", "t20_batting_average": "4.00", "t20_bowling_average": "19.85", "name": "Suraj Randiv", "t20_catches": "0", "t20_bowling_runs": "139", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "8", "t20_bowling_SR": "18.0"},
{"t20_batting_innings": "121", "t20_50": "31", "t20_bowling_4W": "6", "t20_bowling_matches": "75", "t20_batting_matches": "75", "t20_BBM": "9/148", "player_ifo": ["{'Born':'\nJanuary 17, 1990, Galle '}", "{'Current age':'28 years 149 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Allrounder'}", "{'Batting style':'Left-hand bat'}"], "t20_BBI": "7/70", "t20_batting_NO": "15", "t20_bowling_econ": "3.28", "t20_bowling_balls": "7789", "t20_bowling_10W": "0", "t20_BF": "5279", "t20_bowling_wickets": "151", "profile": ["\nA promising allrounder who delivers left-arm spin at a sharp pace and plays brisk innings from the lower order, Chaturanga de Silva made his international debut in the 2014 Asia Cup, after good returns for the A team against the visiting England Lions. Two forties and five wickets in the first unofficial Test in February cleared the path to his selection in the Asia Cup squad, in Rangana Herath's absence, but de Silva had been among the most consistent fringe players for over a year, both for the A team and for his domestic team, Moors Sports Club. \n", "De Silva was earmarked as a future international prospect by the Sanath Jayasuriya-led selection panel in 2013, when he hit first-class hundreds in both the A-team tour to the West Indies, and New Zealand A's tour of Sri Lanka. An alumni of Galle's St. Aloysius College, de Silva has also played for Colts Cricket Club and Chilaw Marians in his domestic career."], "t20_bowling_innings": "107", "t20_highest_score": "150", "t20_bowling_5W": "6", "t20_stumps": "55", "t20_SR": "79.10", "t20_batting_average": "39.39", "t20_bowling_average": "28.19", "name": "Chaturanga de Silva", "t20_catches": "84", "t20_bowling_runs": "4258", "t20_100": "5", "country": ["Sri Lanka"], "t20_batting_runs": "4176", "t20_bowling_SR": "51.5"},
{"t20_batting_innings": "177", "t20_50": "41", "t20_bowling_4W": "1", "t20_bowling_matches": "110", "t20_batting_matches": "110", "t20_BBM": "5/22", "player_ifo": ["{'Born':'\nAugust 14, 1989, Colombo '}", "{'Current age':'28 years 305 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Allrounder'}", "{'Batting style':'Right-hand bat'}"], "t20_BBI": "5/71", "t20_batting_NO": "15", "t20_bowling_econ": "3.44", "t20_bowling_balls": "4287", "t20_bowling_10W": "0", "t20_BF": "8040", "t20_bowling_wickets": "80", "profile": ["\nA busy middle-order batsman, packing a punch off the back foot, Ashan Priyanjan has been among the steady young risers in Sri Lankan cricket. Priyanjan captained Sri Lanka's under-19 team in the 2008 youth World Cup, and has since made himself a Sri Lanka A regular, through improving performances for Bloomfield, Tamil Union, and most recently, Ports Authority Cricket Club. \n", "\u2028Priyanjan is powerful square of the wicket, and brings a fearlessness to the batting crease that has seen him launch regular counterattacks when the top order has failed - both with Sri Lanka A, and his club sides. He has also become a canny offspinner, capable of delivering tight, probing overs when relieving the frontline bowlers.", "\u2028He struck a sparkling 74 on ODI debut against Pakistan, in the UAE, and has since shown more glimpses of bright promise for Sri Lanka. Priyanjan has become a regular member of the one-day squad, but competes for a middle-order position with several other players. He played in the side that won the Asia Cup in 2014, and also helped Sri Lanka defeat England in a bilateral series three months later.", "\n"], "t20_bowling_innings": "95", "t20_highest_score": "235", "t20_bowling_5W": "2", "t20_stumps": "104", "t20_SR": "73.76", "t20_batting_average": "36.61", "t20_bowling_average": "30.75", "name": "Ashan Priyanjan", "t20_catches": "133", "t20_bowling_runs": "2460", "t20_100": "9", "country": ["Sri Lanka"], "t20_batting_runs": "5931", "t20_bowling_SR": "53.5"},
{"t20_batting_innings": "-", "t20_50": "-", "t20_bowling_4W": "1", "t20_bowling_matches": "3", "t20_batting_matches": "3", "t20_BBM": "4/23", "player_ifo": ["{'Born':'\nJune 10, 1991, Ragama '}", "{'Current age':'27 years 5 days'}", "{'Major teams':'Sri Lanka,'}", "{'Also known as':'Lakshan Rangika'}", "{'Playing role':'Bowler'}"], "t20_BBI": "4/23", "t20_batting_NO": "-", "t20_bowling_econ": "6.33", "t20_bowling_balls": "72", "t20_bowling_10W": "0", "t20_BF": "-", "t20_bowling_wickets": "6", "profile": ["\nA slight, left-arm wristspinner from the outskirts of Colombo, Lakshan Sandakan's consistent hauls in first-class cricket have placed him among the Sri Lanka's best spin prospects. Operating off a shuffling approach and a quick action, Sandakan has the ability to turn the ball both ways, and skid it into the pad. \n", "Graduating from De Mazenod College in Kandana, Sandakan made an inauspicious start to his first-class career in 2012, for Saracens Sports Club. But having moved to Colombo Cricket Club by the following season, the wickets began to come thick and fast. He topped the 2013-14 first-class season's wicket-takers' list, with 54 scalps at an average of 19.14. For those efforts, Sandakan earned a place in Sri Lanka's ODI squad to play England at home in late 2014, though he never played a game.", "In the following season, Sandakan was again impressive, with 45 wickets at 24.28. When he went on to top the wicket-taker's list for the second time in three seasons, in the 2015-16 Premier League Tournament, the national selectors rewarded him with a place in the A team squad to England. Sandakan took 5 for 40 in a List A match against Derbyshire on that tour, and was given a second call-up to the national squad almost immediately, thanks in part to injuries to several frontline Sri Lanka players. This time he got to play at the international level, making his Test debut against Australia in Pallekele."], "t20_bowling_innings": "3", "t20_highest_score": "-", "t20_bowling_5W": "0", "t20_stumps": "2", "t20_SR": "-", "t20_batting_average": "-", "t20_bowling_average": "12.66", "name": "Lakshan Sandakan", "t20_catches": "-", "t20_bowling_runs": "76", "t20_100": "-", "country": ["Sri Lanka"], "t20_batting_runs": "-", "t20_bowling_SR": "12.0"},
{"t20_batting_innings": "3", "t20_50": "0", "t20_bowling_4W": "0", "t20_bowling_matches": "3", "t20_batting_matches": "3", "t20_BBM": "5/94", "player_ifo": ["{'Born':'\nApril 10, 1995, Wennappuwa '}", "{'Current age':'23 years 66 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Bowler'}", "{'Batting style':'Right-hand bat'}"], "t20_BBI": "3/25", "t20_batting_NO": "0", "t20_bowling_econ": "3.40", "t20_bowling_balls": "420", "t20_bowling_10W": "0", "t20_BF": "25", "t20_bowling_wickets": "8", "profile": [], "t20_bowling_innings": "5", "t20_highest_score": "23", "t20_bowling_5W": "0", "t20_stumps": "0", "t20_SR": "96.00", "t20_batting_average": "8.00", "t20_bowling_average": "29.75", "name": "Shehan Madushanka", "t20_catches": "2", "t20_bowling_runs": "238", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "24", "t20_bowling_SR": "52.5"},
{"t20_batting_innings": "131", "t20_50": "21", "t20_bowling_4W": "15", "t20_bowling_matches": "85", "t20_batting_matches": "85", "t20_BBM": "11/144", "player_ifo": ["{'Born':'\nMarch 21, 1989, Kandy '}", "{'Current age':'29 years 86 days'}", "{'Major teams':'Colombo Cricket Club,'}", "{'Nickname':'Podda'}", "{'Playing role':'Allrounder'}"], "t20_BBI": "7/49", "t20_batting_NO": "6", "t20_bowling_econ": "3.84", "t20_bowling_balls": "13221", "t20_bowling_10W": "3", "t20_BF": "3879", "t20_bowling_wickets": "296", "profile": ["\nAn allrounder who bowls slow left-arm, Sachith Pathirana's rise to the national side has been long-awaited, since his promising time in the Under-19 team. Pathirana captained Sri Lanka's U-19 side at the age of 17 in a one-day tri-series against England and Malaysia, and a year later, made a major impact in the 2008 U-19 World Cup, hitting 231 runs and taking 10 wickets.  \n", "Having come through Trinity College in Kandy, Pathirana began his senior career at Colombo Cricket Club, before moving to Ragama Cricket Club, and eventually Chilaw Marians in 2012, for whom he had been a talisman. His strong first-class performances in the 2012-13 season did not escape the national selectors' attention, and he was named in the squad for Sri Lanka's home ODI series against Bangladesh, but Pathirana did not manage to nail down a place in the national squad. ", "With spin-bowling allrounders the likes of Chaturanga de Silva, Seekkuge Prasanna and Milinda Siriwardana also in the national fray, Pathirana competes in a crowded field. "], "t20_bowling_innings": "139", "t20_highest_score": "168", "t20_bowling_5W": "20", "t20_stumps": "49", "t20_SR": "86.67", "t20_batting_average": "26.89", "t20_bowling_average": "28.63", "name": "Sachith Pathirana", "t20_catches": "126", "t20_bowling_runs": "8475", "t20_100": "3", "country": ["Sri Lanka"], "t20_batting_runs": "3362", "t20_bowling_SR": "44.6"},
{"t20_batting_innings": "14", "t20_50": "4", "t20_bowling_4W": "-", "t20_bowling_matches": "14", "t20_batting_matches": "14", "t20_BBM": "-", "player_ifo": ["{'Born':'\nFebruary 2, 1995, Moratuwa '}", "{'Current age':'23 years 133 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Wicketkeeper batsman'}", "{'Batting style':'Right-hand bat'}"], "t20_BBI": "-", "t20_batting_NO": "0", "t20_bowling_econ": "-", "t20_bowling_balls": "-", "t20_bowling_10W": "-", "t20_BF": "217", "t20_bowling_wickets": "-", "profile": ["\nBlessed with a compact technique, an aggressive impulse, and an iron resolve, Kusal Mendis rose rapidly through the age-group system, and quickly became one of the most promising young batsmen in the world. He had played only 16 first-class innings before he made his Test debut at the age of 20, and had hit only one first-class hundred before he made a maiden Test ton. That hundred - the 176 against Australia at Pallekele - was a match-flipping, series-defining knock, which given the fact no other batsman mustered more than 55 in the game, is one of the greatest ever Sri Lankan innings. Since then, Mendis has put together some impressive ODI innings as well, and has embedded himself in the Test top four.  \n", "A highly-rated graduate of Sri Lanka's school cricket system, Mendis' batting had earned him a large following long before he was on the national selectors' radar. As wicketkeeper and flowing right-hand batsman, Mendis won the Schoolboy Cricketer of the Year award in 2013, for his work in the Prince of Wales College team. He was Sri Lanka's under-19 captain in the Youth World Cup the following year.", "Mendis began his first-class career for Bloomfield Cricket Club in the Premier League Tournament of 2015. He had a middling first season, hitting 459 runs at an average of 30.60, but continued to be followed closely as Sri Lanka moved to flood their Test team with youth. It was Mendis' excellent returns in the Moin-ud-Dowlah three-day tournament in Hyderabad that paved his route to the national team. He was named in the squad to play West Indies in October 2015, and made his debut in the second match of that series."], "t20_bowling_innings": "-", "t20_highest_score": "70", "t20_bowling_5W": "-", "t20_stumps": "2", "t20_SR": "152.53", "t20_batting_average": "23.64", "t20_bowling_average": "-", "name": "Kusal Mendis", "t20_catches": "16", "t20_bowling_runs": "-", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "331", "t20_bowling_SR": "-"},
{"t20_batting_innings": "12", "t20_50": "2", "t20_bowling_4W": "0", "t20_bowling_matches": "12", "t20_batting_matches": "12", "t20_BBM": "1/11", "player_ifo": ["{'Born':'\nJanuary 8, 1986, Kandy '}", "{'Current age':'32 years 158 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Batsman'}", "{'Batting style':'Right-hand bat'}"], "t20_BBI": "1/11", "t20_batting_NO": "3", "t20_bowling_econ": "8.21", "t20_bowling_balls": "149", "t20_bowling_10W": "0", "t20_BF": "178", "t20_bowling_wickets": "5", "profile": ["\nA batting allrounder with powerful shots square of the wicket, Asela Gunaratne put together several impressive seasons for Sri Lanka Army Sports Club before eventually being considered for higher honours in 2016. Though not an immediately eye-catching player, it was his consistency that impressed: batting in the middle order, Gunaratne averaged more than 50 in three of the four Premier League Tournaments between 2012 and 2016. A wide range of strokes, including his favoured reverse sweep, had also helped his case.  \n", "He was a sporadic performer when chosen in the A side, yet was immediately effective in Tests, hitting a fifty and a hundred in his first three international innings, against Zimbabwe. With Angelo Mathews ruled out of that tour, Gunaratne also earned a place in the ODI squad, and made an impact with his dibbly-dobbly slow-medium bowling, claiming eight wickets at an average of 14.5 as Sri Lanka won the tri-nations trophy in Zimbabwe, in November 2016. He had an impact in the shortest format too, helping Sri Lanka claim a T20 series in Australia in February 2017 by knocking off 84 in 46 balls in Geelong - three consecutive sixes in the penultimate over included, in a chase of 174. ", "A graduate of Sri Rahula College Kandy, Gunaratne has also served as a Bombardier in the Sri Lanka Army.", "\n"], "t20_bowling_innings": "10", "t20_highest_score": "84*", "t20_bowling_5W": "0", "t20_stumps": "5", "t20_SR": "126.40", "t20_batting_average": "25.00", "t20_bowling_average": "40.80", "name": "Asela Gunaratne", "t20_catches": "6", "t20_bowling_runs": "204", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "225", "t20_bowling_SR": "29.8"},
{"t20_batting_innings": "5", "t20_50": "0", "t20_bowling_4W": "-", "t20_bowling_matches": "5", "t20_batting_matches": "5", "t20_BBM": "-", "player_ifo": ["{'Born':'\nAugust 30, 1995, Colombo '}", "{'Current age':'22 years 289 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Wicketkeeper batsman'}", "{'Batting style':'Right-hand bat'}"], "t20_BBI": "-", "t20_batting_NO": "0", "t20_bowling_econ": "-", "t20_bowling_balls": "-", "t20_bowling_10W": "-", "t20_BF": "80", "t20_bowling_wickets": "-", "profile": ["\nIn the longest format, Sadeera Samarawickrama is a dashing wicketkeeper-batsman who plays in the middle order. In limited-overs cricket, he has routinely set his teams off to fast starts as an opener. In any case, few school leavers of his vintage have made such a successful transition to the senior level. The national selectors have taken notice.  \n", "Having begun his cricket at Colombo's Thurstan College, Samarawickrama moved to St Joseph's in his final years, and prospered in the school system, even hitting a memorable 126 in St Joseph's biggest fixture of the year. That performance propelled him into Sri Lanka's Under-19 squad, where he again impressed, making 265 runs at an average of 44.17 in the 2014 Youth World Cup. ", "While Kusal Mendis - his team-mate from that U-19 side - was fast-tracked to the national side, Samarawickrama would have to earn his place through first-class performances. His first season with Colts Cricket Club was modest, but his second was good, and his third outstanding. Samarawickrama topped Tier-A run charts with 1016 runs at 59.76 in the 2016-17 season. On his debut for Sri Lanka A in February 2017, he cracked 185 runs off 223 balls against a strong England Lions attack. ", "On the back of those runs, Samarawickrama earned a maiden Sri Lanka call-up in September of the same year, for the Tests against Pakistan."], "t20_bowling_innings": "-", "t20_highest_score": "32", "t20_bowling_5W": "-", "t20_stumps": "3", "t20_SR": "106.25", "t20_batting_average": "17.00", "t20_bowling_average": "-", "name": "Sadeera Samarawickrama", "t20_catches": "0", "t20_bowling_runs": "-", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "85", "t20_bowling_SR": "-"},
{"t20_batting_innings": "12", "t20_50": "1", "t20_bowling_4W": "-", "t20_bowling_matches": "13", "t20_batting_matches": "13", "t20_BBM": "-", "player_ifo": ["{'Born':'\nJune 23, 1993, Kandy '}", "{'Current age':'24 years 357 days'}", "{'Major teams':'Sri Lanka,'}", "{'Nickname':'Niro'}", "{'Playing role':'Wicketkeeper batsman'}"], "t20_BBI": "-", "t20_batting_NO": "0", "t20_bowling_econ": "-", "t20_bowling_balls": "-", "t20_bowling_10W": "-", "t20_BF": "179", "t20_bowling_wickets": "-", "profile": ["\nAn attacking left-hand and unorthodox wicketkeeper-batsman, Niroshan Dickwella arrived in first-class cricket already having built some hype through his stellar school cricket career. He won Sri Lanka's Schoolboy Cricketer of the Year award in 2012, having hit over 1000 runs in the previous season, and having led Trinity College to the national championship.  \n", "Since then, Dickwella has become Nondescripts Cricket Club's regular wicketkeeper across all competitions, thanks in part to Dinesh Chandimal's long absences from domestic cricket, due to his presence in the national team. Dickwella has been particularly impressive in across all formats in domestic cricket, and has been a fixture in the Sri Lanka A team. He made his Test debut as far back as July 2014 - at the age of 21 - but despite a sparkling 72 at SSC against a strong South Africa attack, did not hold his place for long. ", "He made another foray into international cricket in 2017, and on this occasion had some success with his impressive range of behind-the-wicket strokes, which include all manner of sweeps, scoops and ramp shots. "], "t20_bowling_innings": "-", "t20_highest_score": "68", "t20_bowling_5W": "-", "t20_stumps": "7", "t20_SR": "139.10", "t20_batting_average": "20.75", "t20_bowling_average": "-", "name": "Niroshan Dickwella", "t20_catches": "5", "t20_bowling_runs": "-", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "249", "t20_bowling_SR": "-"},
{"t20_batting_innings": "17", "t20_50": "1", "t20_bowling_4W": "0", "t20_bowling_matches": "25", "t20_batting_matches": "25", "t20_BBM": "3/39", "player_ifo": ["{'Born':'\nFebruary 10, 1992, Colombo '}", "{'Current age':'26 years 125 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Bowler'}", "{'Batting style':'Right-hand bat'}"], "t20_BBI": "3/39", "t20_batting_NO": "9", "t20_bowling_econ": "4.68", "t20_bowling_balls": "870", "t20_bowling_10W": "0", "t20_BF": "259", "t20_bowling_wickets": "26", "profile": ["\nA sharp right-arm seamer who specialises in moving the ball away from the right-handers, Vikum Sanjaya caught the national selectors' notice in December 2016 with figures of 7 for 102 in a first-class match for Burgher Recreation Club.\n  \nHe had not, however, been especially effective in domestic cricket before his national call-up for the tour of South Africa. In 17 first-class matches, he had taken 38 wickets at an average of 33.78, and he had only played 13 List A games. Nevertheless, the selectors said they saw potential in him - a sentiment echoed by coaches, who had picked him out and trained him in the fast bowling academy since soon after Sanjaya left school.\n  \nSanjaya made his first-class debut in 2012 for Colombo Cricket Club, but has also played for Badureliya Sports Club and Saracens Sports Club, in addition to BRC.", "\n \n"], "t20_bowling_innings": "24", "t20_highest_score": "55*", "t20_bowling_5W": "0", "t20_stumps": "6", "t20_SR": "105.40", "t20_batting_average": "34.12", "t20_bowling_average": "26.11", "name": "Vikum Sanjaya", "t20_catches": "15", "t20_bowling_runs": "679", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "273", "t20_bowling_SR": "33.4"},
{"t20_batting_innings": "19", "t20_50": "2", "t20_bowling_4W": "0", "t20_bowling_matches": "22", "t20_batting_matches": "22", "t20_BBM": "3/33", "player_ifo": ["{'Born':'\nDecember 16, 1993, Galle '}", "{'Current age':'24 years 181 days'}", "{'Major teams':'Sri Lanka,'}", "{'Batting style':'Left-hand bat'}", "{'Bowling style':'Right-arm fast-medium'}"], "t20_BBI": "3/33", "t20_batting_NO": "1", "t20_bowling_econ": "5.85", "t20_bowling_balls": "329", "t20_bowling_10W": "0", "t20_BF": "511", "t20_bowling_wickets": "9", "profile": [], "t20_bowling_innings": "15", "t20_highest_score": "59", "t20_bowling_5W": "0", "t20_stumps": "2", "t20_SR": "81.80", "t20_batting_average": "23.22", "t20_bowling_average": "35.66", "name": "Thikshila de Silva", "t20_catches": "11", "t20_bowling_runs": "321", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "418", "t20_bowling_SR": "36.5"},
{"t20_batting_innings": "15", "t20_50": "1", "t20_bowling_4W": "0", "t20_bowling_matches": "15", "t20_batting_matches": "15", "t20_BBM": "2/3", "player_ifo": ["{'Born':'\nMarch 17, 1991, Panadura '}", "{'Current age':'27 years 90 days'}", "{'Major teams':'Sri Lanka,'}", "{'Nickname':'Dana'}", "{'Playing role':'Allrounder'}"], "t20_BBI": "2/3", "t20_batting_NO": "0", "t20_bowling_econ": "7.75", "t20_bowling_balls": "82", "t20_bowling_10W": "0", "t20_BF": "248", "t20_bowling_wickets": "5", "profile": ["\nA poised, attacking left-handed opener groomed in part at Sinhalese Sports Club, Danushka Gunathilaka was plucked from the domestic system largely on potential, and drafted into Sri Lanka's A team for the tour of New Zealand in mid-2015. He impressed on that trip, hitting two smart fifties from four innings, to finish as the team's second-highest run-scorer. \n", "Those performances earned him a national call-up for the home series against West Indies in November. Gunathilaka then earned a second trip to New Zealand - with the senior team this time - and despite modest returns from his first three ODIs, he struck a rapid 65 in Nelson to win a Man-of-the-Match award.", "Gunathilaka was not originally part of Sri Lanka's squad for the 2017 Champions Trophy in England, but came into it ahead of their second match thanks to an injury to Chamara Kapugedara. He made a stunning entrance, scoring 76 off 72 balls to help haul down a target of 322. ", "That innings was followed by a run of three fifties and a maiden hundred in the ODI series against Zimbabwe, cue a call-up to the Test side. The Test debut was a disappointment, Gunathilaka scoring 16 and 2 before falling to loose strokes in both innings.", "Strong square of the wicket, particularly on the off side, Gunathilaka, who admires Kumar Sangakkara, is also a part-time offspinner. He had played in Sri Lanka's Under-19 team in the 2009 Youth World Cup."], "t20_bowling_innings": "7", "t20_highest_score": "51", "t20_bowling_5W": "0", "t20_stumps": "4", "t20_SR": "125.00", "t20_batting_average": "20.66", "t20_bowling_average": "21.20", "name": "Danushka Gunathilaka", "t20_catches": "10", "t20_bowling_runs": "106", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "310", "t20_bowling_SR": "16.4"},
{"t20_batting_innings": "10", "t20_50": "0", "t20_bowling_4W": "0", "t20_bowling_matches": "19", "t20_batting_matches": "19", "t20_BBM": "3/30", "player_ifo": ["{'Born':'\nJanuary 11, 1992, Ragama '}", "{'Current age':'26 years 155 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Bowler'}", "{'Batting style':'Right-hand bat'}"], "t20_BBI": "3/30", "t20_batting_NO": "6", "t20_bowling_econ": "8.54", "t20_bowling_balls": "403", "t20_bowling_10W": "0", "t20_BF": "40", "t20_bowling_wickets": "16", "profile": ["\nTall, slim and slippery, Dushmantha Chameera arrived at NCC in 2012, and was quickly marked out as a bowler for the future. First among his virtues is pace, generated from a slightly round-arm action that sacrifices movement. Capable of consistently hitting speeds of over 140 kph, coaches believe he had become the quickest bowler in the country by 23. He had played only a handful of games in his first two seasons, but came into his own in NCC's 2013-14 championship run, claiming 32 first-class cricket at 21.18. \n", "Chameera's earned a place in Sri Lanka's Test squad to New Zealand at the end of 2014, but did not play a Test, despite a strong showing in the tour match. He was a late entry into the ODI squad for the same tour, and made his international debut in Wellington, and claimed the wicket of Ross Taylor with a 146kph delivery in his first over."], "t20_bowling_innings": "19", "t20_highest_score": "12", "t20_bowling_5W": "0", "t20_stumps": "6", "t20_SR": "77.50", "t20_batting_average": "7.75", "t20_bowling_average": "35.87", "name": "Dushmantha Chameera", "t20_catches": "0", "t20_bowling_runs": "574", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "31", "t20_bowling_SR": "25.1"},
{"t20_batting_innings": "4", "t20_50": "0", "t20_bowling_4W": "0", "t20_bowling_matches": "9", "t20_batting_matches": "9", "t20_BBM": "2/37", "player_ifo": ["{'Born':'\nOctober 19, 1986, Negombo '}", "{'Current age':'31 years 239 days'}", "{'Major teams':'Sri Lanka,'}", "{'Nickname':'Sirasa'}", "{'Playing role':'Bowler'}"], "t20_BBI": "2/37", "t20_batting_NO": "3", "t20_bowling_econ": "10.83", "t20_bowling_balls": "159", "t20_bowling_10W": "0", "t20_BF": "6", "t20_bowling_wickets": "7", "profile": ["\nFast bowler Nuwan Pradeep didn't play with a cricket ball till he was 20 but less than three years later he was in Sri Lanka's Test squad. He won a pace contest in 2007, impressing the talent scouts in a soft-ball event, and was sent straight to Sri Lanka Cricket's academy. He follows in the Sri Lankan tradition of maverick bowlers with unconventional actions. Like Lasith Malinga, he has a slinging action and has troubled many batsmen in domestic cricket with his pace, generated from a long run-up. Pradeep toured Sri Lanka A to Australia in 2010, where he was among the quickest bowlers from both sides though he didn't bag many wickets. Less than a month later, he was rewarded with a call-up to the national squad for the second Test against India.", " July 2010   \n"], "t20_bowling_innings": "9", "t20_highest_score": "0*", "t20_bowling_5W": "0", "t20_stumps": "2", "t20_SR": "0.00", "t20_batting_average": "0.00", "t20_bowling_average": "41.00", "name": "Nuwan Pradeep", "t20_catches": "0", "t20_bowling_runs": "287", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "0", "t20_bowling_SR": "22.7"},
{"t20_batting_innings": "59", "t20_50": "1", "t20_bowling_4W": "5", "t20_bowling_matches": "61", "t20_batting_matches": "61", "t20_BBM": "12/185", "player_ifo": ["{'Born':'\nMay 22, 1987, Kegalle '}", "{'Current age':'31 years 24 days'}", "{'Major teams':'Sri Lanka,'}", "{'Batting style':'Left-hand bat'}", "{'Bowling style':'Left-arm medium-fast'}"], "t20_BBI": "9/68", "t20_batting_NO": "18", "t20_bowling_econ": "4.20", "t20_bowling_balls": "7011", "t20_bowling_10W": "1", "t20_BF": "957", "t20_bowling_wickets": "164", "profile": ["\nA left-arm swing bowler who specialises in bringing the ball back into right-handers, Chaminda Bandara was plucked from relative obscurity when he was picked for Sri Lanka's 2016 Test squad to England as an injury replacement. It was Bandara's bowling form that impressed the national selectors. He was the only seam bowler among the Premier League Tournament's 15 top wicket-takers in the 2016 first-class season, having taken 33 wickets at an average of 26.30. \n \nIt is Bandara's bowling intelligence as much as his swing that has made him one of Sri Lanka's steady domestic performers. He has spent time in the fast-bowling academy at Khettarama, but had not played for the A team before his call-up to the national squad. \n  \n", "Having been born in Kegalle, and having played for St. Mary's College in his hometown, Bandara has played for the Sinhalese Sports Club, and, most recently, the Ports Authority Cricket Club.\n"], "t20_bowling_innings": "109", "t20_highest_score": "55", "t20_bowling_5W": "3", "t20_stumps": "20", "t20_SR": "36.46", "t20_batting_average": "8.51", "t20_bowling_average": "29.95", "name": "Chaminda Bandara", "t20_catches": "2", "t20_bowling_runs": "4912", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "349", "t20_bowling_SR": "42.7"},
{"t20_batting_innings": "19", "t20_50": "0", "t20_bowling_4W": "0", "t20_bowling_matches": "22", "t20_batting_matches": "22", "t20_BBM": "2/17", "player_ifo": ["{'Born':'\nDecember 4, 1985, Nagoda '}", "{'Current age':'32 years 193 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Allrounder'}", "{'Batting style':'Left-hand bat'}"], "t20_BBI": "2/17", "t20_batting_NO": "3", "t20_bowling_econ": "8.95", "t20_bowling_balls": "138", "t20_bowling_10W": "0", "t20_BF": "208", "t20_bowling_wickets": "8", "profile": ["\nA busy middle-order batsman and a capable left-arm spinner, Milinda Siriwardana broke through to the national side in 2015 after several years of encouraging domestic returns. Outstanding form in the 2015 Premier League Tournament prompted his elevation. He was the first-class season's top scorer with 1144 runs at an average of 67.29, and had also claimed 20 wickets for Badureliya Cricket Club.  \n", "Siriwardana showcased his attacking flair when he made his ODI and T20 debuts during Pakistan's mid-year tour of Sri Lanka, and memorably struck his first international fifty in 25 deliveries during a breakneck 114-run ODI stand with Angelo Mathews. A successful initiation in those formats paved the route to his Test debut against West Indies later the same year. ", "He had made his first-class debut for Sebastianites Cricket and Athletic Club in 2005, and had played for Sri Lanka A for several years before getting his international break. Siriwardana came close to national recognition was when he was included in the 30-member provisional squad for the 2009 World T20, but he was left out of the final team. That call-up came close on the heels of his maiden first-class ton, 135 for Basnahira South against Ruhuna in the SLC Inter-Provincial Tournament, a match in which he also claimed five wickets."], "t20_bowling_innings": "13", "t20_highest_score": "42", "t20_bowling_5W": "0", "t20_stumps": "6", "t20_SR": "132.21", "t20_batting_average": "17.18", "t20_bowling_average": "25.75", "name": "Milinda Siriwardana", "t20_catches": "12", "t20_bowling_runs": "206", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "275", "t20_bowling_SR": "17.2"},
{"t20_batting_innings": "17", "t20_50": "0", "t20_bowling_4W": "0", "t20_bowling_matches": "29", "t20_batting_matches": "29", "t20_BBM": "5/37", "player_ifo": ["{'Born':'\nJune 1, 1993, Matara '}", "{'Current age':'25 years 14 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Bowler'}", "{'Batting style':'Right-hand bat'}"], "t20_BBI": "5/37", "t20_batting_NO": "8", "t20_bowling_econ": "6.31", "t20_bowling_balls": "1082", "t20_bowling_10W": "0", "t20_BF": "82", "t20_bowling_wickets": "32", "profile": ["\nVirtually unheard of before 2015, the first inkling of right-arm seamer Kasun Rajitha's potential came during a three-dayer against the touring Indians in August of that year. He took 5 for 68 on a spicy Khettarama deck in that match, dismissing Shikhar Dhawan, Virat Kohli and Rohit Sharma in a single spell, before claiming Kohli's wicket in the second innings as well.", "\n \nAchieving appreciable seam movement at a sharp pace, and from a high release point, Rajitha proved to be a penetrative T20 bowler in the following domestic season. He was the second-highest wicket-taker in the Super T20 Provincial Tournament, with 10 scalps in six matches. That performance earned him an international T20 debut, where he claimed two wickets in his first over, against India in Pune. \n"], "t20_bowling_innings": "28", "t20_highest_score": "12*", "t20_bowling_5W": "1", "t20_stumps": "6", "t20_SR": "39.02", "t20_batting_average": "3.55", "t20_bowling_average": "35.59", "name": "Kasun Rajitha", "t20_catches": "2", "t20_bowling_runs": "1139", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "32", "t20_bowling_SR": "33.8"},
{"t20_batting_innings": "7", "t20_50": "1", "t20_bowling_4W": "0", "t20_bowling_matches": "7", "t20_batting_matches": "7", "t20_BBM": "1/3", "player_ifo": ["{'Born':'\nSeptember 6, 1991, Colombo '}", "{'Current age':'26 years 282 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Allrounder'}", "{'Batting style':'Right-hand bat'}"], "t20_BBI": "1/3", "t20_batting_NO": "0", "t20_bowling_econ": "5.75", "t20_bowling_balls": "24", "t20_bowling_10W": "0", "t20_BF": "154", "t20_bowling_wickets": "1", "profile": ["\nA technically correct top-order batsman from the southern reaches of the island, Dhananjaya de Silva briefly caught the national selectors' eye in 2015, then went on to have a bumper domestic season that marked him out for more intensive national duty. De Silva had been picked on potential in Sri Lanka's mid-year T20s against Pakistan, in 2015, but didn't quite convince he was a T20 batsman, hitting 45 off 47 balls across two innings. What followed, though, was an emphatic blooming. \n", "De Silva first topped the batting charts in the Super T20 Provincial Tournament in early 2016, hitting 234 runs at a strike rate of 133, in six innings. Months later, he was the star of Tamil Union's first victorious first-class campaign in 55 years, hitting 868 runs at 54.20, which featured a crucial fourth-innings 121 in the match that clinched his team the title. Incredibly, though usually employed as a part-time offspinner, de Silva was also his club's most successful bowler that season, claiming 32 wickets at 14.23. ", "Those numbers helped earn him his first call-up to Sri Lanka's Test squad - for the England tour in May and June 2016. ", " Andrew Fernando, May 2016 "], "t20_bowling_innings": "3", "t20_highest_score": "62", "t20_bowling_5W": "0", "t20_stumps": "2", "t20_SR": "108.44", "t20_batting_average": "23.85", "t20_bowling_average": "23.00", "name": "Dhananjaya de Silva", "t20_catches": "2", "t20_bowling_runs": "23", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "167", "t20_bowling_SR": "24.0"},
{"t20_batting_innings": "3", "t20_50": "0", "t20_bowling_4W": "-", "t20_bowling_matches": "3", "t20_batting_matches": "3", "t20_BBM": "-", "player_ifo": ["{'Born':'\nFebruary 26, 1991, Colombo '}", "{'Current age':'27 years 109 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Middle-order batsman'}", "{'Batting style':'Left-hand bat'}"], "t20_BBI": "-", "t20_batting_NO": "0", "t20_bowling_econ": "-", "t20_bowling_balls": "-", "t20_bowling_10W": "-", "t20_BF": "34", "t20_bowling_wickets": "-", "profile": ["\nA positive left-handed middle-order batsman, Kithuruwan Vithanage made his Test debut against Bangladesh, after hitting a better than run-a-ball 168 not out against the same team in a tour match one week earlier. Vithanage did little more than manning the ropes on a flat deck in Galle for much of his first Test, but when he finally made the trip to the crease on the fifth day, a lively 59 from 70 balls that featured seven fours and a six, marked him out as a young talent worth investing in. \n", "An alumnus of Royal College in Colombo, Vithanage played age-level cricket for Sri Lanka and was the vice-captain of the Under-19 side for the 2010 World Cup. In 2009, he had been the third-highest run-scorer in an Under-19 tour to Australia. He currently plays for Tamil Union."], "t20_bowling_innings": "-", "t20_highest_score": "38", "t20_bowling_5W": "-", "t20_stumps": "1", "t20_SR": "117.64", "t20_batting_average": "13.33", "t20_bowling_average": "-", "name": "Kithuruwan Vithanage", "t20_catches": "0", "t20_bowling_runs": "-", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "40", "t20_bowling_SR": "-"},
{"t20_batting_innings": "24", "t20_50": "1", "t20_bowling_4W": "0", "t20_bowling_matches": "24", "t20_batting_matches": "24", "t20_BBM": "3/16", "player_ifo": ["{'Born':'\nSeptember 9, 1991, Negombo '}", "{'Current age':'26 years 279 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Allrounder'}", "{'Batting style':'Right-hand bat'}"], "t20_BBI": "3/16", "t20_batting_NO": "5", "t20_bowling_econ": "7.42", "t20_bowling_balls": "139", "t20_bowling_10W": "0", "t20_BF": "262", "t20_bowling_wickets": "9", "profile": ["\nAn explosive middle-order batsman, and steady right-arm seam bowler, Dasun Shanaka worked his way into Sri Lanka's T20 side through several seasons of good performances for Sinhalese Sports Club. Born and educated in Negombo, Shanaka made his T20 international debut against Pakistan in August 2015, but it wasn't until the following domestic season that he achieved wide acclaim. Batting at No. 4 in an AIA Premier T20 match against Saracens Sports Club, Shanaka struck a Sri Lankan record 16 sixes in an innings worth 123 from 46 balls. That wasn't even his biggest T20 score of the last week. He had hit 131 off 48 balls against Galle Cricket Club one week earlier. \n", " \nBut it was with the ball that Shanaka first made his mark on the international stage. He took 3 for 16 on a Pune greentop, against India, having only taken two domestic T20 wickets before then. He played bright cameos in Sri Lanka's 2016 World T20 campaign, and in April he was picked in the Test squad - for Sri Lanka's tour of England -  for the first time, largely on his potential, rather than his first-class record."], "t20_bowling_innings": "13", "t20_highest_score": "54", "t20_bowling_5W": "0", "t20_stumps": "3", "t20_SR": "115.64", "t20_batting_average": "15.94", "t20_bowling_average": "19.11", "name": "Dasun Shanaka", "t20_catches": "18", "t20_bowling_runs": "172", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "303", "t20_bowling_SR": "15.4"},
{"t20_batting_innings": "111", "t20_50": "28", "t20_bowling_4W": "2", "t20_bowling_matches": "65", "t20_batting_matches": "65", "t20_BBM": "10/88", "player_ifo": ["{'Born':'\nSeptember 12, 1991, Colombo '}", "{'Current age':'26 years 276 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Batting allrounder'}", "{'Batting style':'Left-hand bat'}"], "t20_BBI": "7/22", "t20_batting_NO": "4", "t20_bowling_econ": "3.48", "t20_bowling_balls": "6308", "t20_bowling_10W": "1", "t20_BF": "5459", "t20_bowling_wickets": "152", "profile": [], "t20_bowling_innings": "108", "t20_highest_score": "237", "t20_bowling_5W": "9", "t20_stumps": "54", "t20_SR": "81.80", "t20_batting_average": "41.73", "t20_bowling_average": "24.09", "name": "Shehan Jayasuriya", "t20_catches": "57", "t20_bowling_runs": "3663", "t20_100": "8", "country": ["Sri Lanka"], "t20_batting_runs": "4466", "t20_bowling_SR": "41.5"},
{"t20_batting_innings": "56", "t20_50": "1", "t20_bowling_4W": "10", "t20_bowling_matches": "43", "t20_batting_matches": "43", "t20_BBM": "10/155", "player_ifo": ["{'Born':'\nFebruary 5, 1990, Wattala '}", "{'Current age':'28 years 130 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Bowler'}", "{'Batting style':'Right-hand bat'}"], "t20_BBI": "7/77", "t20_batting_NO": "20", "t20_bowling_econ": "3.85", "t20_bowling_balls": "7799", "t20_bowling_10W": "1", "t20_BF": "1355", "t20_bowling_wickets": "199", "profile": [], "t20_bowling_innings": "79", "t20_highest_score": "69", "t20_bowling_5W": "15", "t20_stumps": "16", "t20_SR": "43.46", "t20_batting_average": "16.36", "t20_bowling_average": "25.16", "name": "Jeffrey Vandersay", "t20_catches": "8", "t20_bowling_runs": "5007", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "589", "t20_bowling_SR": "39.1"},
{"t20_batting_innings": "11", "t20_50": "0", "t20_bowling_4W": "0", "t20_bowling_matches": "18", "t20_batting_matches": "18", "t20_BBM": "3/19", "player_ifo": ["{'Born':'\nJuly 12, 1995, Colombo '}", "{'Current age':'22 years 338 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Bowler'}", "{'Batting style':'Right-hand bat'}"], "t20_BBI": "3/19", "t20_batting_NO": "3", "t20_bowling_econ": "5.09", "t20_bowling_balls": "746", "t20_bowling_10W": "0", "t20_BF": "91", "t20_bowling_wickets": "22", "profile": ["\nKnown for his ability to generate awkward bounce from a height of 6'7\", and swing the ball, Binura Fernando has been among the leading schoolboy-cricket names over the past two years, claiming 84 wickets in the 2013 season. A left-arm seamer, Fernando was called up to Sri Lanka's Test squad during the 2014 home series against Pakistan despite not having played first-class cricket. He was chosen largely on the strength of his performances for DS Senanayake College and the Sri Lanka Under-19 team. \n"], "t20_bowling_innings": "18", "t20_highest_score": "14", "t20_bowling_5W": "0", "t20_stumps": "2", "t20_SR": "84.61", "t20_batting_average": "9.62", "t20_bowling_average": "28.81", "name": "Binura Fernando", "t20_catches": "3", "t20_bowling_runs": "634", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "77", "t20_bowling_SR": "33.9"},
{"t20_batting_innings": "123", "t20_50": "20", "t20_bowling_4W": "1", "t20_bowling_matches": "75", "t20_batting_matches": "75", "t20_BBM": "6/100", "player_ifo": ["{'Born':'\nApril 24, 1989, Colombo '}", "{'Current age':'29 years 52 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Opening batsman'}", "{'Batting style':'Right-hand bat'}"], "t20_BBI": "5/47", "t20_batting_NO": "0", "t20_bowling_econ": "3.19", "t20_bowling_balls": "3532", "t20_bowling_10W": "0", "t20_BF": "4183", "t20_bowling_wickets": "57", "profile": ["\nAn opening batsman of rare power, Dilshan Munaweera earned a call-up to the national side for the 2012 World Twenty20 after impressing at the inaugural SLPL, in which he was the top scorer. Brutal on anything short and almost as severe when bowlers overpitch, Munaweera is a firm convert of the Sanath Jayasuriya school of opening - hit it hard, long and over the infield. His 44 from 23 balls to clinch the SLPL title for the Uva Next franchise included five sixes and two fours.  \n", "A product of Nalanda College and the son of  a former first-class cricketer, Munaweera began playing cricket at age 12 and rose through the age grades to represent Sri Lanka at U-19 level, before moving on to U-23 cricket at Bloomfield Cricket Club. He had been in and out of the Sri Lanka A team prior to national selection, but had marked himself out as a future talent nonetheless, first as a teenager when he struck six consecutive sixes in the Ananda-Nalanda school cricket match, and later by winning a single-wicket tournament organised by SLC. ", "Munaweera was dropped from Sri Lanka's T20 side in early 2013, after a string of modest scores, and didn't play a part in the 2014 World T20 victory. He featured in several overseas domestic T20 tournaments over the following years however, the Caribbean Premier League and Bangladesh Premier League among them. His success at those events, and an improving record in Sri Lanka's domestic tournaments, paved the way for his re-selection to the Sri Lanka squad - for a T20 tour to Australia in February 2017. "], "t20_bowling_innings": "83", "t20_highest_score": "191", "t20_bowling_5W": "1", "t20_stumps": "51", "t20_SR": "91.75", "t20_batting_average": "31.20", "t20_bowling_average": "33.01", "name": "Dilshan Munaweera", "t20_catches": "114", "t20_bowling_runs": "1882", "t20_100": "8", "country": ["Sri Lanka"], "t20_batting_runs": "3838", "t20_bowling_SR": "61.9"},
{"t20_batting_innings": "1", "t20_50": "0", "t20_bowling_4W": "0", "t20_bowling_matches": "3", "t20_batting_matches": "3", "t20_BBM": "2/30", "player_ifo": ["{'Born':'\nJune 23, 1986, Chilaw '}", "{'Current age':'31 years 357 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Bowler'}", "{'Batting style':'Right-hand bat'}"], "t20_BBI": "2/30", "t20_batting_NO": "0", "t20_bowling_econ": "8.18", "t20_bowling_balls": "66", "t20_bowling_10W": "0", "t20_BF": "7", "t20_bowling_wickets": "3", "profile": ["\nA brisk fast-medium bowler, Shaminda Eranga's ODI and Test debuts were both spectacular: in his first ODI, against Australia in 2011, he needed only two balls to make an impact, bowling Brad Haddin through the gate. An even more memorable dismissal followed, when Ricky Ponting failed to read his slower ball and pushed back a return catch.  He then made his Test debut against the same opposition, and became only the second Sri Lankan bowler to strike with his very first delivery, when he dismissed Shane Watson.  \n", "He was laid low by a nerve-related back injury soon after his arrival at international cricket, but after nine months on the sidelines returned to the national side to take a wicket in his first over in Twenty20 internationals, completing an unprecedented treble. He has since made himself a mainstay in the Test attack, and despite his inexperience, is often called to spearhead the pacemen, when Chanaka Welegedara is absent through injury.", "Eranga was discovered at an all-island pace bowling competition in 2006 by former Sri Lanka medium pacer Champaka Ramanayake and Anusha Samaranayake. Their discovery led to his being picked for the Chilaw Marians and eventually the division-one premier league tournament, which in turn led to a place in the Sri Lanka development squad. ", "He made his debut for Sri Lanka A in 2010 and following good performances on a tour of England in 2011, was flown back to Sri Lanka to be part of the national side, a move which fetched immediate results.", "\n", "\n"], "t20_bowling_innings": "3", "t20_highest_score": "6", "t20_bowling_5W": "0", "t20_stumps": "1", "t20_SR": "85.71", "t20_batting_average": "6.00", "t20_bowling_average": "30.00", "name": "Shaminda Eranga", "t20_catches": "0", "t20_bowling_runs": "90", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "6", "t20_bowling_SR": "22.0"},
{"t20_batting_innings": "20", "t20_50": "0", "t20_bowling_4W": "-", "t20_bowling_matches": "26", "t20_batting_matches": "26", "t20_BBM": "-", "player_ifo": ["{'Born':'\nAugust 9, 1989, Moratuwa '}", "{'Current age':'28 years 310 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Top-order batsman'}", "{'Batting style':'Left-hand bat'}"], "t20_BBI": "-", "t20_batting_NO": "2", "t20_bowling_econ": "-", "t20_bowling_balls": "-", "t20_bowling_10W": "-", "t20_BF": "267", "t20_bowling_wickets": "-", "profile": ["\nAn unflappable young talent with a killer cover drive, Lahiru Thirimanne came to the international landscape highly regarded by Sri Lanka's cricket elite, with Aravinda de Silva most notably among his champions. An opener by reputation, Thirimanne made his debut in early 2010 and earnt sporadic places in the national side over the next two years, but it was not until he was moved to the middle order in 2012 that he unearthed the consistency that would make him a regular at the top level.  \n", "A measured batsman, if at times a limited one, Thirimanne has been a contrasting ally for Sri Lanka's middle-order dashers in ODI cricket, striking particularly memorable partnerships with Angelo Mathews to lift Sri Lanka out of trouble.", "His forte has always been the longest form however, as evidenced by a first-class average of almost 60 in his first full season for Ragama CC. Thirimanne could not recreate that form in his first few Tests as an opener, but conjured his finest innings to date at no. 4, when he stepped off a plane 36 hours before the 2013 New Year Test to strike a sparkling 91 on the first day in Sydney. Ten days later he hit a maiden international hundred in an ODI to take Sri Lanka to victory in Adelaide. ", " ", " "], "t20_bowling_innings": "-", "t20_highest_score": "44", "t20_bowling_5W": "-", "t20_stumps": "8", "t20_SR": "108.98", "t20_batting_average": "16.16", "t20_bowling_average": "-", "name": "Lahiru Thirimanne", "t20_catches": "5", "t20_bowling_runs": "-", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "291", "t20_bowling_SR": "-"},
{"t20_batting_innings": "51", "t20_50": "1", "t20_bowling_4W": "3", "t20_bowling_matches": "60", "t20_batting_matches": "60", "t20_BBM": "4/30", "player_ifo": ["{'Born':'\nSeptember 8, 1991, Kandy '}", "{'Current age':'26 years 280 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Opening batsman'}", "{'Batting style':'Left-hand bat'}"], "t20_BBI": "4/30", "t20_batting_NO": "7", "t20_bowling_econ": "4.90", "t20_bowling_balls": "2046", "t20_bowling_10W": "0", "t20_BF": "1066", "t20_bowling_wickets": "45", "profile": [], "t20_bowling_innings": "55", "t20_highest_score": "102", "t20_bowling_5W": "0", "t20_stumps": "21", "t20_SR": "94.93", "t20_batting_average": "23.00", "t20_bowling_average": "37.13", "name": "Ramith Rambukwella", "t20_catches": "50", "t20_bowling_runs": "1671", "t20_100": "1", "country": ["Sri Lanka"], "t20_batting_runs": "1012", "t20_bowling_SR": "45.4"},
{"t20_batting_innings": "20", "t20_50": "0", "t20_bowling_4W": "0", "t20_bowling_matches": "20", "t20_batting_matches": "20", "t20_BBM": "2/45", "player_ifo": ["{'Born':'\nJune 27, 1985, Balapitiya '}", "{'Current age':'32 years 353 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Allrounder'}", "{'Batting style':'Right-hand bat'}"], "t20_BBI": "2/45", "t20_batting_NO": "6", "t20_bowling_econ": "7.18", "t20_bowling_balls": "300", "t20_bowling_10W": "0", "t20_BF": "161", "t20_bowling_wickets": "10", "profile": ["\nAn accurate legspinner, and an improving late-order hitter, Seekkuge Prasanna has become one of several Sri Lanka spin options in limited-overs internationals. Quick through the air, and possessed of a good googly, Prasanna has largely been picked when the pitch is expected to take turn. He is prolific in domestic cricket, where he and Ajantha Mendis regularly run through teams on the spin-friendly Sri Lanka Army pitch at Panagoda. Prasanna has also recently begun to feature in foreign competitions, playing in the Bangladesh Premier League and for county side Northamptonshire, predominantly in the T20 Blast.  \n \n \nHaving worked his way into the Sri Lanka Army team in 2006 as a 21-year-old, Prasanna made an immediate impact, taking 3 for 23 in 10 overs on his domestic one-day debut against Lankan Cricket Club. He built an outstanding List A record over the next five years, picking up 73 wickets at 18.38 in 45 matches, and was selected in the Sri Lanka A team that toured England in 2011. When he took a six-wicket haul while opening the bowling against England Lions, the Sri Lankan selectors immediately took note - having him fly back home for the two final ODIs against Australian. He took 3 for 32 in his international debut. \n", "\n", "\n \n"], "t20_bowling_innings": "18", "t20_highest_score": "37*", "t20_bowling_5W": "0", "t20_stumps": "4", "t20_SR": "132.91", "t20_batting_average": "15.28", "t20_bowling_average": "35.90", "name": "Seekkuge Prasanna", "t20_catches": "13", "t20_bowling_runs": "359", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "214", "t20_bowling_SR": "30.0"},
{"t20_batting_innings": "146", "t20_50": "31", "t20_bowling_4W": "1", "t20_bowling_matches": "89", "t20_batting_matches": "89", "t20_BBM": "4/78", "player_ifo": ["{'Born':'\nFebruary 23, 1990, Moratuwa '}", "{'Current age':'28 years 112 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Allrounder'}", "{'Batting style':'Right-hand bat'}"], "t20_BBI": "4/77", "t20_batting_NO": "13", "t20_bowling_econ": "3.67", "t20_bowling_balls": "1308", "t20_bowling_10W": "0", "t20_BF": "7829", "t20_bowling_wickets": "18", "profile": ["\nOne of the brightest young batting talents in Sri Lanka, Angelo Perera was named in Sri Lanka's ODI squad for the home series against Bangladesh in March 2013 after a prolific domestic limited-overs season for Nondescripts Cricket Club. A powerful middle-order batsman with an arsenal of strokes and no lack of audacity, Perera has carved out an impressive List-A record over five years, and his first-class numbers are even better.  \n", "A product of St. Peter's College in Colombo, Perera led his school side in his senior year, and also featured in Sri Lanka's Under-19 teams from 2007 to 2009. His domestic career has been followed keenly for several years now and it seems a case of when he will be granted an extended run in the national team, rather than if."], "t20_bowling_innings": "49", "t20_highest_score": "244", "t20_bowling_5W": "0", "t20_stumps": "89", "t20_SR": "75.47", "t20_batting_average": "44.42", "t20_bowling_average": "44.50", "name": "Angelo Perera", "t20_catches": "133", "t20_bowling_runs": "801", "t20_100": "13", "country": ["Sri Lanka"], "t20_batting_runs": "5909", "t20_bowling_SR": "72.6"},
{"t20_batting_innings": "12", "t20_50": "0", "t20_bowling_4W": "1", "t20_bowling_matches": "24", "t20_batting_matches": "24", "t20_BBM": "4/46", "player_ifo": ["{'Born':'\nFebruary 9, 1985, Colombo '}", "{'Current age':'33 years 126 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Bowler'}", "{'Batting style':'Right-hand bat'}"], "t20_BBI": "4/46", "t20_batting_NO": "6", "t20_bowling_econ": "6.77", "t20_bowling_balls": "486", "t20_bowling_10W": "0", "t20_BF": "66", "t20_bowling_wickets": "25", "profile": ["\nSachithra Senanayake is an offspinner who made his international debut for Sri Lanka in the fourth ODI in the series against South Africa in 2011-12. At the time of making his international debut, Senanayake had already taken 297 first-class wickets from 59 matches at a fantastic average of 20.50, and 107 List A wickets at an economy rate of 3.90. In the 2010-11 season, he was the fourth-highest wicket-taker in Tier A of the Premier League tournament, taking 45 wickets in eight matches at 15.17. He has also shown that he can handle the pressure of limited-over matches: in the 2011-12 Premier Limited-Over tournament, Sri Lanka's main one-day competition, he was the highest wicket-taker with 16 in six games at 11.18. \n", "Senanayake's first foray into international cricket was short-lived though, and after several mediocre performances, he was released back into the domestic fold, where he continued to excel. He came back into international focus when he was bought for $650,000 by the Kolkata Knight Riders IPL franchise in 2013, largely owing to his reputation of possessing one of the better carrom balls in Sri Lanka. ", "It turned out to be a good year for him, as he also put in a strong showing in the first-class competition, made a Test debut for Sri Lanka against Pakistan in December, and also had an extended run in the one-day team. He had mixed fortunes in the ODI series against England in June 2014 - remarkable figures of 4 for 13 that skittled England out for 99 were offset by news of his action being reported as suspect. ", "While the controversy didn't stop him from being at the centre of a tense series win for Sri Lanka - he was also involved in a Mankading incident against Jos Buttler in the decider - he was dealt a big blow when his action was found to be illegal in July.  Senanayake remodeled his action and returned to international cricket in December 2014. "], "t20_bowling_innings": "23", "t20_highest_score": "17", "t20_bowling_5W": "0", "t20_stumps": "3", "t20_SR": "84.84", "t20_batting_average": "9.33", "t20_bowling_average": "21.96", "name": "Sachithra Senanayake", "t20_catches": "1", "t20_bowling_runs": "549", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "56", "t20_bowling_SR": "19.4"},
{"t20_batting_innings": "-", "t20_50": "-", "t20_bowling_4W": "0", "t20_bowling_matches": "1", "t20_batting_matches": "1", "t20_BBM": "-", "player_ifo": ["{'Born':'\nMay 30, 1983, Ragama '}", "{'Current age':'35 years 16 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Bowler'}", "{'Batting style':'Right-hand bat'}"], "t20_BBI": "-", "t20_batting_NO": "-", "t20_bowling_econ": "12.33", "t20_bowling_balls": "18", "t20_bowling_10W": "0", "t20_BF": "-", "t20_bowling_wickets": "0", "profile": ["\nA promising career with the national team looked certain when Dhammika Prasad took two wickets in as many balls in his first over of his ODI debut against Bangladesh in 2006. He went on to play two more matches before his career was cut short by a back injury which kept him out of the game for six months. Having recovered, he was selected for the Sri Lanka A tour to England in 2007 where he hoped to perform well and regain his place in the national team. What may have helped him in this quest was his ability to bowl at the death in ODIs, having worked hard to develop subtle variations including a good yorker. Consistent performances on the domestic front earned him a first Test cap against India in August 2008 as Sri Lanka sought to add pace to their attack. He did not disappoint, taking five wickets in the match, including the wicket of India's best batsman, Virender Sehwag, in both innings.  \n", "Interestingly, Prasad started his cricket at De Mazenod College, Kandana, as a No.3 batsman. He played in this position till he reached 17 when he was forced to switch \nover to bowling fast because the school could not find anyone suitable to bowl with the new ball. He was selected for the Under-19 World Cup in 2002 and his performance paid off when he won a six-month scholarship to play in England. Prasad's best bowling effort was in the now-defunct provincial tournament when he took six wickets for 25 (match bag ten wickets) for Southern Province against Uva Province at the Galle International Stadium in 2004. ", " August 2008"], "t20_bowling_innings": "1", "t20_highest_score": "-", "t20_bowling_5W": "0", "t20_stumps": "0", "t20_SR": "-", "t20_batting_average": "-", "t20_bowling_average": "-", "name": "Dhammika Prasad", "t20_catches": "-", "t20_bowling_runs": "37", "t20_100": "-", "country": ["Sri Lanka"], "t20_batting_runs": "-", "t20_bowling_SR": "-"},
{"t20_batting_innings": "2", "t20_50": "0", "t20_bowling_4W": "0", "t20_bowling_matches": "3", "t20_batting_matches": "3", "t20_BBM": "3/26", "player_ifo": ["{'Born':'\nJuly 22, 1982, Panadura '}", "{'Current age':'35 years 328 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Allrounder'}", "{'Batting style':'Right-hand bat'}"], "t20_BBI": "3/26", "t20_batting_NO": "0", "t20_bowling_econ": "7.20", "t20_bowling_balls": "60", "t20_bowling_10W": "0", "t20_BF": "6", "t20_bowling_wickets": "3", "profile": ["\nA classical offspinner with an easy, fluent action, Dilruwan Perera had been among Sri Lanka's steadiest first-class performers, before being rewarded with the second spinner's berth in the Test squad, in 2014. It was with the bat that he made his first impression in Tests: Perera came within five runs of scoring a century on debut, against Pakistan at Sharjah, but he asserted himself as a bowler soon enough. His second-innings five-wicket haul helped wipe Bangladesh out in Dhaka, less than two weeks later. \n", "\nNo big turner of the ball, and possessing only an arm ball as a variation, Perera's strengths lie in accuracy and persistence.  He has honed those skills by practicing spot-bowling intensively, on the advice of Muttiah Muralitharan, one of Perera's idols, alongside Saqlain Mushtaq. In his time in the Test side, Perera has proved a good fit for the attack's ethos of squeezing wickets from the opposition, and he has also been a fine partner for Rangana Herath when the two bowl from opposite ends.", " \nPerera had made rapid progress since starting his career at Sri Sumangala College, Panadura. He toured Australia with the Sri Lanka Under-19 team and, after he made his first-class debut for Panadura Sports Club, was drafted into the A side in 2001. He played one season for Chilaw Marians Cricket Club and holds the bowling record for the Under-23s with 55 wickets from seven matches in 2004.", " \nHe had had some success in A team tours to England and Zimbabwe with both bat and ball, but continued to develop as a bowler through his time at Sri Lanka's Spin Bowling Academy, where he was coached by former offspinners Ashley Mallett and Ruwan Kalpage.", " \nIn limited-overs cricket, Perera earned a call-up to Sri Lanka's squad for the ICC World Twenty20 in South Africa after Muralitharan was ruled out due to injury. He made his ODI debut at home against England in 2007. He forms an integral part of the Colombo Colts domestic side, which he has now represented for 10 years.", "\n"], "t20_bowling_innings": "3", "t20_highest_score": "1", "t20_bowling_5W": "0", "t20_stumps": "0", "t20_SR": "16.66", "t20_batting_average": "0.50", "t20_bowling_average": "24.00", "name": "Dilruwan Perera", "t20_catches": "0", "t20_bowling_runs": "72", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "1", "t20_bowling_SR": "20.0"},
{"t20_batting_innings": "34", "t20_50": "10", "t20_bowling_4W": "-", "t20_bowling_matches": "34", "t20_batting_matches": "34", "t20_BBM": "-", "player_ifo": ["{'Born':'\nAugust 17, 1990, Kalubowila '}", "{'Current age':'27 years 302 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Wicketkeeper batsman'}", "{'Batting style':'Left-hand bat'}"], "t20_BBI": "-", "t20_batting_NO": "0", "t20_bowling_econ": "-", "t20_bowling_balls": "-", "t20_bowling_10W": "-", "t20_BF": "740", "t20_bowling_wickets": "-", "profile": ["\nPossessed of a short backlift, powerful forearms and relentless bloody-mindedness, left-handed batsman Kushal Janith Perera's batting is not just inspired by his hero Sanath Jayasuriya's technique, at times, it seems an exact duplicate.  \n", "Like Jayasuriya, he has a second skill - though it is wicketkeeping rather than slow left-arm, and he was part of Sri Lanka's Under-19 teams, before he joined Colts Cricket Club as a senior. At Colts, Perera quickly set about forging a career founded on aggression and reliability in equal parts, and after two seasons, Sri Lanka's selectors could no longer ignore him. ", "An injury to Kumar Sangakkara saw him earn a place in Sri Lanka's limited-overs squad to Australia in January 2012, where his breezy innings made plain his talent - particularly during a 22 not out at the Gabba that took Sri Lanka home in a low-scoring ODI.  Though a middle-order batsman by reputation, he was promoted to the position of opener in the two Twenty20s that followed, where he continued to play impactful innings", "On return to Sri Lanka, Perera hit a first-class double-ton, then a 275-ball 336, and had proved enough to the selectors to be given a central contract and an extended run in the limited-overs sides.", "Perera hit his maiden ODI century in Mirpur in 2014 to help Sri Lanka complete a 3-0 whitewash over Bangladesh. He then hammered a 17-ball half-century, Sri Lanka's joint-fastest, against Pakistan in Pallekele in July 2015, to equal Jayasuriya's record.", "A month later Perera was handed his Test debut against India in Colombo. He made twin fifties, becoming only the second Sri Lanka batsman to score two half-centuries on debut.", "Perera's burgeoning career hit a stumbling block in December 2015 when he was provisionally suspended from international cricket by the ICC, after having failed a dope test. He was recalled from Sri Lanka's tour of New Zealand and subsequently missed a bilateral T20 series in India, Asia Cup, and World T20.", "His plight appeared bleak when his initial sample tested positive for the performance-enhancing drug, 19-Norandrostenedione, but it grew bleaker when his B sample returned identical results.", "Perera had strong support from SLC, though, and also spent a substantial amount of his own money in fighting the WADA-approved lab's findings. His campaign to be cleared included a trip to England for a polygraph test, a hair analysis and a separate urine test, as well as substantial coordination with his main legal team, which was based in the UK. ", "All this eventually paid off when his name was cleared in May 2016, bringing his suspension to an end after five months out - the Qatar-based lab's findings were deemed \"unsustainable\" for \"scientific and technical reasons\" by an independent expert hired by the ICC."], "t20_bowling_innings": "-", "t20_highest_score": "84", "t20_bowling_5W": "-", "t20_stumps": "10", "t20_SR": "137.83", "t20_batting_average": "30.00", "t20_bowling_average": "-", "name": "Kusal Perera", "t20_catches": "38", "t20_bowling_runs": "-", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "1020", "t20_bowling_SR": "-"},
{"t20_batting_innings": "6", "t20_50": "0", "t20_bowling_4W": "0", "t20_bowling_matches": "15", "t20_batting_matches": "15", "t20_BBM": "2/9", "player_ifo": ["{'Born':'\nOctober 4, 1993, Panadura '}", "{'Current age':'24 years 254 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Allrounder'}", "{'Batting style':'Left-hand bat'}"], "t20_BBI": "2/9", "t20_batting_NO": "3", "t20_bowling_econ": "7.78", "t20_bowling_balls": "316", "t20_bowling_10W": "0", "t20_BF": "29", "t20_bowling_wickets": "12", "profile": ["\nAnother installment from Sri Lanka's production line of unorthodox spinners, Akila Dananjaya sparked controversy when he was picked in the preliminary squad for the 2012 World Twenty20, despite never having played a professional match in his life. Able to deliver a legbreak, googly, carrom ball, doosra and a stock offspinner with astounding control, he had impressed Mahela Jayawardene so much as a net bowler at a Sri Lanka practice session, that Jayawardene requested he be fast-tracked to the national squad. \n", "Dananjaya plays for Jayawardene's Wayamba United franchise in the Sri Lanka Premier League, and earned a call-up to the final 15 for the World Twenty20 after four fine performances in the tournament. He made significant contributions to that World T20 campaign, even playing in the final, but went out of favour with the selectors once Jayawardene stepped down from the captaincy. In the years since, Dananjaya has been sporadically picked in the Sri Lanka A team, but has not quite lived up to the promise of his early months in the spotlight. ", "He was picked again in a Sri Lanka squad for ODIs against Zimbabwe, in June 2017. ", ", June 2017"], "t20_bowling_innings": "15", "t20_highest_score": "11*", "t20_bowling_5W": "0", "t20_stumps": "5", "t20_SR": "100.00", "t20_batting_average": "9.66", "t20_bowling_average": "34.16", "name": "Akila Dananjaya", "t20_catches": "0", "t20_bowling_runs": "410", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "29", "t20_bowling_SR": "26.3"},
{"t20_batting_innings": "56", "t20_50": "5", "t20_bowling_4W": "0", "t20_bowling_matches": "71", "t20_batting_matches": "71", "t20_BBM": "3/16", "player_ifo": ["{'Born':'\nJune 2, 1987, Colombo '}", "{'Current age':'31 years 13 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Allrounder'}", "{'Batting style':'Right-hand bat'}"], "t20_BBI": "3/16", "t20_batting_NO": "18", "t20_bowling_econ": "6.81", "t20_bowling_balls": "969", "t20_bowling_10W": "0", "t20_BF": "890", "t20_bowling_wickets": "37", "profile": ["\nA robust batting technique, nagging consistency with the ball, and athleticism in the field, all set off by an imperturbable temperament, have made Angelo Mathews one of Sri Lanka's most prized assets and a figure on which the team hangs many hopes. He has risen quickly since earning wide acclaim with an acrobatic save in the 2009 World Twenty20, and in February 2013, became Sri Lanka's youngest ever Test captain at 25, after having been groomed for the post for two years.  \n", "In limited overs cricket, Mathews' all-round skills are almost indispensable. When he pulled a quad in the World Cup semi-final in 2011, he forced three changes to the XI that played in the final, as the team strove for the balance he single-handedly delivers. He began his international career with ambitions of becoming a genuine allrounder, but has since given primacy to his batting, and effectively plays as a specialist batsman in the Test side. ", "Often coming to the crease at No. 6, Mathews provides solidity to the lower-middle order, which had been a weakness for Sri Lanka prior to his arrival. In ODIs he has provided two unforgettable finishes - against Australia in 2010, and Pakistan in 2012 - stealing victory with a sublime, sustained assaults, but his best work has come in the Test format. In an outstanding 2014, in which he scored 1160 runs at an average of 77.33, Mathews' finest moment was the rousing 160 at Headingley, which transformed that match and saw Sri Lanka win their first Test series in England (not including the one-off Test in 1998). ", "Mathews' appointment to the captaincy has heralded a renewed focus on youth and development by the Sri Lanka selectors. Once a successful leader of the St. Joseph's College side and the Sri Lanka Under-19 team, Mathews has been charged with ushering in a new age of Sri Lankan cricket."], "t20_bowling_innings": "57", "t20_highest_score": "81*", "t20_bowling_5W": "0", "t20_stumps": "23", "t20_SR": "118.53", "t20_batting_average": "27.76", "t20_bowling_average": "29.75", "name": "Angelo Mathews", "t20_catches": "35", "t20_bowling_runs": "1101", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "1055", "t20_bowling_SR": "26.1"},
{"t20_batting_innings": "-", "t20_50": "-", "t20_bowling_4W": "-", "t20_bowling_matches": "1", "t20_batting_matches": "1", "t20_BBM": "-", "player_ifo": ["{'Born':'\nSeptember 2, 1973, Matara '}", "{'Current age':'44 years 286 days'}", "{'Major teams':'Sri Lanka,'}", "{'Batting style':'Right-hand bat'}", "{'Bowling style':'Right-arm offbreak'}"], "t20_BBI": "-", "t20_batting_NO": "-", "t20_bowling_econ": "-", "t20_bowling_balls": "-", "t20_bowling_10W": "-", "t20_BF": "-", "t20_bowling_wickets": "-", "profile": ["\nA slight man but nevertheless powerful batsman who has a sound technique, Indika de Saram broke into the national side in the 1999-2000 tour of Zimbabwe. However, he languished at number six or seven in the order and was never really given an opportunity to express his full potential. He was educated at St Thomas' College in Matara, with whom he also kept wicket and became one of the most consistent scorers in the country. The highlight of his schools career was when he scored 304 runs in just 149 balls, including 25 sixes and 19 fours at the Uyanwatte Stadium against Sri Devanand College, Ambalangoda. He was a regular in the A team before breaking into the national team. He was dropped from the side in 2001 and eight years later, made a comeback when he was included in the Twenty20 squad against the touring Indians and later for the ICC World Twenty20 in England.  \n"], "t20_bowling_innings": "-", "t20_highest_score": "-", "t20_bowling_5W": "-", "t20_stumps": "1", "t20_SR": "-", "t20_batting_average": "-", "t20_bowling_average": "-", "name": "Indika de Saram", "t20_catches": "-", "t20_bowling_runs": "-", "t20_100": "-", "country": ["Sri Lanka"], "t20_batting_runs": "-", "t20_bowling_SR": "-"},
{"t20_batting_innings": "166", "t20_50": "22", "t20_bowling_4W": "", "t20_bowling_matches": "114", "t20_batting_matches": "114", "t20_BBM": "", "player_ifo": ["{'Born':'\nJanuary 29, 1981, Gampola '}", "{'Current age':'37 years 137 days'}", "{'Major teams':'Sri Lanka,'}", "{'Batting style':'Left-hand bat'}", "{'Bowling style':'Right-arm medium-fast'}"], "t20_BBI": "6/47", "t20_batting_NO": "12", "t20_bowling_econ": "3.80", "t20_bowling_balls": "11238", "t20_bowling_10W": "0", "t20_BF": "", "t20_bowling_wickets": "277", "profile": ["\nA right-arm medium-pacer whose stock delivery is the out-swinger Kaushalya Weeraratne was earmarked early as an allrounder for the future. His bowling was stronger than his batting during the initial stages but he had the ability to hit the ball cleanly. He was an integral part of Sri Lanka's Under-19 World Cup squad in 2000 and his 12 wickets at an average of 13 apiece help fast track his progress to the senior team. Weeraratne made his ODI debut in the Asia Cup in 2000. However, poor form and injury resulted in Weeraratne failing to cement his place in the team and he spent nearly five years on the sidelines after his 11th ODI in 2003. He forced himself back into reckoning after successfully remodeling his action and scored a blistering half-century off 12 balls, which was the fastest fifty in one-day cricket, during a domestic match in 2005. He received a call up to the national squad for the tour of the West Indies and the Asia Cup in 2008.", " \n"], "t20_bowling_innings": "", "t20_highest_score": "135", "t20_bowling_5W": "5", "t20_stumps": "71", "t20_SR": "", "t20_batting_average": "26.78", "t20_bowling_average": "25.72", "name": "Kaushalya Weeraratne", "t20_catches": "", "t20_bowling_runs": "7127", "t20_100": "2", "country": ["Sri Lanka"], "t20_batting_runs": "4125", "t20_bowling_SR": "40.5"},
{"t20_batting_innings": "2", "t20_50": "0", "t20_bowling_4W": "0", "t20_bowling_matches": "2", "t20_batting_matches": "2", "t20_BBM": "2/31", "player_ifo": ["{'Born':'\nMay 20, 1982, Colombo '}", "{'Current age':'36 years 26 days'}", "{'Major teams':'Sri Lanka,'}", "{'Nickname':'Loku'}", "{'Batting style':'Right-hand bat'}"], "t20_BBI": "2/31", "t20_batting_NO": "0", "t20_bowling_econ": "8.00", "t20_bowling_balls": "36", "t20_bowling_10W": "0", "t20_BF": "13", "t20_bowling_wickets": "2", "profile": ["\nLoukaracchchi is unfortunate that he belongs to an era where there are two\nother right-arm legspinners are also vying for a berth in the national team. The presence of Upul Chandana and Malinga Bandara meant that 'Loku', as he is referred to by  team-mates, had no place in the national team which also has the inimitable\noffspinner Muttiah Muralitharan. \n", "It seems Loku has somewhat decided that his best chance to play in the national team is in the shorter version of the game. He says he loves to play one-day cricket and his style of bowling and batting is most suited to it. \"It is difficult to play one-day cricket than Test cricket because the intensity is great. I love the challenge,\" Loku said. ", "He believes as a legspinner he has a lot to learn, but admits gaining experience each time he plays for his country. He is also a useful batsman down the order with two first-class centuries and a batting average of 27.    ", "He had an outstanding career at St. Peter's College where he won the best bowler's prize and was also voted Schoolboy Cricketer of the Year. Loku then joined Bloomfield in 1999 and represented them till last season when he changed clubs and went to SSC where he took 14 wickets in the Premier league semi-final against Colts and followed it up with a century which is the best performance of his career so far.", "Has benefited from attending Sri Lanka Spin Academy headed by former Sri Lanka offspinner Ruwan Kalpage and from coaching received from Sri Lanka A-team coach Chandika Hathurusingha.    \n", " ", " July 2007"], "t20_bowling_innings": "2", "t20_highest_score": "11", "t20_bowling_5W": "0", "t20_stumps": "1", "t20_SR": "84.61", "t20_batting_average": "5.50", "t20_bowling_average": "24.00", "name": "Kaushal Lokuarachchi", "t20_catches": "0", "t20_bowling_runs": "48", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "11", "t20_bowling_SR": "18.0"},
{"t20_batting_innings": "30", "t20_50": "0", "t20_bowling_4W": "2", "t20_bowling_matches": "58", "t20_batting_matches": "58", "t20_BBM": "4/31", "player_ifo": ["{'Born':'\nJuly 22, 1982, Nittambuwa '}", "{'Current age':'35 years 328 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Bowler'}", "{'Batting style':'Right-hand bat'}"], "t20_BBI": "4/31", "t20_batting_NO": "9", "t20_bowling_econ": "7.45", "t20_bowling_balls": "1231", "t20_bowling_10W": "0", "t20_BF": "184", "t20_bowling_wickets": "66", "profile": ["\nKulasekara made an instant impression in his first ODI, against England at Dambulla in November 2003, after being selected from relative obscurity. From a bustling run-up and whippy open-chested action, he generates a lively pace, moves the ball off the seam and can reverse-swing the ball. Most importantly though, he can maintain a tight line and length. He started his career as a softball enthusiast before he shifted his focus to cricket, joining Nugegoda Cricket Club and then Galle Cricket Club. He also won the best bowler award in the 2002-03 domestic competition. A maiden test fifty against England at Lord's in 2006 showed his natural batting abilities in the lower order. But his bowling during the same tour lacked penetration and he dropped out of the squad for eight months. However, having worked hard on his action and gaining an extra yard of pace, he secured a place in Sri Lanka's World Cup squad. He rose to become one of Sri Lanka's strike bowlers, and in a 11-month period starting April 2008, he took 47 wickets. That helped him jump to the top of the ICC ODI rankings the following March. ", "\n", " March 2009 \n"], "t20_bowling_innings": "58", "t20_highest_score": "31", "t20_bowling_5W": "0", "t20_stumps": "17", "t20_SR": "116.84", "t20_batting_average": "10.23", "t20_bowling_average": "23.18", "name": "Nuwan Kulasekara", "t20_catches": "7", "t20_bowling_runs": "1530", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "215", "t20_bowling_SR": "18.6"},
{"t20_batting_innings": "108", "t20_50": "12", "t20_bowling_4W": "3", "t20_bowling_matches": "128", "t20_batting_matches": "128", "t20_BBM": "5/44", "player_ifo": ["{'Born':'\nMay 19, 1978, Kalutara '}", "{'Current age':'40 years 27 days'}", "{'Major teams':'Sri Lanka,'}", "{'Also known as':'Chintha'}", "{'Playing role':'Allrounder'}"], "t20_BBI": "5/44", "t20_batting_NO": "24", "t20_bowling_econ": "3.66", "t20_bowling_balls": "4316", "t20_bowling_10W": "0", "t20_BF": "", "t20_bowling_wickets": "110", "profile": ["\nThe 22-year-old Chintaka Jayasinghe is a forthright and positive all-rounder. He hits the ball hard, bowls useful medium pace and could well break into the national one-day squad in the near future. He was educated at Dharmapala Vidyalaya in Pannipitiya. Perhaps his greatest cricketing moment to date was when he scored twin hundreds against Royal College, Colombo in 1995/96. His name first appeared on the national scene when the selectors included him in the U19 team that toured Malaysia and Singapore in 1994 and England in 1995. He also played for the Sri Lankan 'A' team that toured India in 1998 and played against Zimbabwe 'A' in their 2000 tour of Sri Lanka. He now plays his club cricket for BRC. \n"], "t20_bowling_innings": "", "t20_highest_score": "94", "t20_bowling_5W": "1", "t20_stumps": "51", "t20_SR": "", "t20_batting_average": "26.72", "t20_bowling_average": "23.94", "name": "Chinthaka Jayasinghe", "t20_catches": "", "t20_bowling_runs": "2634", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "2245", "t20_bowling_SR": "39.2"},
{"t20_batting_innings": "73", "t20_50": "9", "t20_bowling_4W": "0", "t20_bowling_matches": "78", "t20_batting_matches": "78", "t20_BBM": "3/9", "player_ifo": ["{'Born':'\nMarch 5, 1986, Watupitiwala '}", "{'Current age':'32 years 102 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Middle-order batsman'}", "{'Batting style':'Left-hand bat'}"], "t20_BBI": "3/9", "t20_batting_NO": "6", "t20_bowling_econ": "4.70", "t20_bowling_balls": "652", "t20_bowling_10W": "0", "t20_BF": "1800", "t20_bowling_wickets": "19", "profile": ["\nExpand Gihan Rupasinghe's initials and you have a name to rival Chaminda Vaas's, which many commentators have tried to pronounce and impress the locals. A product of Nalanda College, Rupasinghe has a reputation in the domestic circuit for being a big hitter in the middle order. He was the second-highest scorer for Tamil Union in the Premier League tournament in 2008-09 and his first-class returns that season - 945 runs at 52.50 - got the attention of the selectors. He was elevated to the A team and scored two half-centuries in the  unofficial Tests against Pakistan A at home. He then made it to Sri Lanka's Twenty20 squad against the touring New Zealanders.", " September 2009\n \n"], "t20_bowling_innings": "26", "t20_highest_score": "102*", "t20_bowling_5W": "0", "t20_stumps": "19", "t20_SR": "86.55", "t20_batting_average": "23.25", "t20_bowling_average": "26.89", "name": "Gihan Rupasinghe", "t20_catches": "54", "t20_bowling_runs": "511", "t20_100": "1", "country": ["Sri Lanka"], "t20_batting_runs": "1558", "t20_bowling_SR": "34.3"},
{"t20_batting_innings": "235", "t20_50": "41", "t20_bowling_4W": "1", "t20_bowling_matches": "163", "t20_batting_matches": "163", "t20_BBM": "", "player_ifo": ["{'Born':'\nJune 4, 1982, Colombo '}", "{'Current age':'36 years 11 days'}", "{'Major teams':'Sri Lanka,'}", "{'Batting style':'Left-hand bat'}", "{'Bowling style':'Legbreak'}"], "t20_BBI": "4/36", "t20_batting_NO": "20", "t20_bowling_econ": "4.44", "t20_bowling_balls": "2868", "t20_bowling_10W": "0", "t20_BF": "", "t20_bowling_wickets": "55", "profile": ["\nKandamby is a cricketer who has not fulfilled the promise he showed as a schoolboy at Ananda College, one of the country's leading Buddhist institutions. He holds the highest individual score of 144 in the traditional match against Nalanda made in 1999. The following year was his best, aggregating 940 runs from 12 matches and was selected captain of the Sri Lanka Under-19 side to tour Australia where he won the Man-of-the-Series award with some sterling contributions. Graduating to the Sri Lanka A side, he toured India and hit five half-centuries which saw him being selected for the Sri Lanka team's tour to New Zealand. He was picked for Sri Lanka's tour to Zimbabwe in 2004 but a lack of consistency meant he was dropped after just four ODI appearances.  \n", "He is the first to admit that he did not completely grab the opportunities that came his way. In an attempt to win back his place, he took over the captaincy of Bloomfield in 2004 and thrice scored ninety in the Premier league. In 2005-06, he won the Premier limited overs Man-of-the-Tournament award. The retirement of Russell Arnold after the 2007 World Cup opened up a spot for him but he had to wait more than a year for a recall. He returned to Zimbabwe and scored a crucial 40 in a low-scoring game to set up the victory, and that set in motion an exceptional run of form for Kandamby that saw him break into the Test squad for Sri Lanka's tour of India in late 2009. ", "For several years, he competed for a spot in the one-day middle order with Thilan Samaraweera and Chamara Kapugedera but lost out to them in the race for a place in the 2011 World Cup squad. That June, however, following several months of turmoil in Sri Lankan cricket, he returned to the one-day squad as vice-captain, and took charge in the Twenty20 against England at Bristol after Tillakaratne Dilshan was ruled out with a broken thumb.\n", " "], "t20_bowling_innings": "", "t20_highest_score": "340*", "t20_bowling_5W": "0", "t20_stumps": "85", "t20_SR": "", "t20_batting_average": "40.73", "t20_bowling_average": "38.65", "name": "Thilina Kandamby", "t20_catches": "", "t20_bowling_runs": "2126", "t20_100": "19", "country": ["Sri Lanka"], "t20_batting_runs": "8758", "t20_bowling_SR": "52.1"},
{"t20_batting_innings": "112", "t20_50": "12", "t20_bowling_4W": "8", "t20_bowling_matches": "85", "t20_batting_matches": "85", "t20_BBM": "7/69", "player_ifo": ["{'Born':'\nFebruary 17, 1988, Balangoda '}", "{'Current age':'30 years 118 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Allrounder'}", "{'Batting style':'Right-hand bat'}"], "t20_BBI": "7/58", "t20_batting_NO": "18", "t20_bowling_econ": "3.58", "t20_bowling_balls": "9305", "t20_bowling_10W": "0", "t20_BF": "2838", "t20_bowling_wickets": "190", "profile": ["\nUdana is a talented left-arm fast-bowling allrounder, whose variety and changes of pace have seen him appear sporadically for Sri Lanka's T20 side. Capable of moving the ball off the seam, Udana is possessed of a number of slower balls, including one out of the back of his hand that has brought him some success at the top level. He was fast-tracked into the Sri Lanka squad for the 2009 World T20 in England and played a role in Sri Lanka's progress to the final in that tournament. However, he did not play the 2010 World T20, and had largely been ignored by the national selectors until early 2017. \n", " While still a schoolboy, at DS Senanayake College, he joined Nondescripts CC, but even before he could represent them in a domestic match he was selected to play for Sri Lanka Under-20 Schools side in the ongoing U-23 Division I youth tournament. He was selected to tour South Africa with the Sri Lanka A team in August 2008 without having played a single first-class match, and was the leading wicket-taker in the Inter-Provincial T20 tournament in 2008-09, helping Wayamba to the title and a berth in the Champions Twenty20 League. \n", " ", " "], "t20_bowling_innings": "135", "t20_highest_score": "109*", "t20_bowling_5W": "3", "t20_stumps": "54", "t20_SR": "84.70", "t20_batting_average": "25.57", "t20_bowling_average": "29.24", "name": "Isuru Udana", "t20_catches": "94", "t20_bowling_runs": "5557", "t20_100": "2", "country": ["Sri Lanka"], "t20_batting_runs": "2404", "t20_bowling_SR": "48.9"},
{"t20_batting_innings": "15", "t20_50": "0", "t20_bowling_4W": "0", "t20_bowling_matches": "16", "t20_batting_matches": "16", "t20_BBM": "1/9", "player_ifo": ["{'Born':'\nJanuary 10, 1981, Washington DC, United States of America '}", "{'Current age':'37 years 156 days'}", "{'Major teams':'Sri Lanka,'}", "{'Batting style':'Left-hand bat'}", "{'Bowling style':'Right-arm offbreak'}"], "t20_BBI": "1/9", "t20_batting_NO": "4", "t20_bowling_econ": "12.75", "t20_bowling_balls": "8", "t20_bowling_10W": "0", "t20_BF": "188", "t20_bowling_wickets": "1", "profile": ["\nA graceful left-hander, Jehan Mubarak plays the game as though it was his birthright, and after representing his country at Under-15, U-17 and U-19 level, maybe it is. Born in Washington DC, the son of a respected scientist, Mubarak returned to Sri Lanka to attend Royal College in Colombo. He made his debut against Bangladesh in 2002 and impressed as a replacement in South Africa with classy 48 but a poor ODI run (68 runs in 7 innings) has limited opportunities since. He is a useful offspinner, an excellent fielder, a useful Twenty20 batsman and also a national swimming champion.", "\n", " March 2008\n \n"], "t20_bowling_innings": "2", "t20_highest_score": "46*", "t20_bowling_5W": "0", "t20_stumps": "9", "t20_SR": "126.59", "t20_batting_average": "21.63", "t20_bowling_average": "17.00", "name": "Jehan Mubarak", "t20_catches": "8", "t20_bowling_runs": "17", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "238", "t20_bowling_SR": "8.0"},
{"t20_batting_innings": "3", "t20_50": "0", "t20_bowling_4W": "0", "t20_bowling_matches": "4", "t20_batting_matches": "4", "t20_BBM": "3/32", "player_ifo": ["{'Born':'\nDecember 31, 1979, Nagoda '}", "{'Current age':'38 years 166 days'}", "{'Major teams':'Sri Lanka,'}", "{'Batting style':'Right-hand bat'}", "{'Bowling style':'Legbreak'}"], "t20_BBI": "3/32", "t20_batting_NO": "1", "t20_bowling_econ": "6.85", "t20_bowling_balls": "84", "t20_bowling_10W": "0", "t20_BF": "15", "t20_bowling_wickets": "4", "profile": ["\nMalinga Bandara was earmarked from an early age as a legspinner of great potential. On the basis of his school performances he was selected for the Under-19 tour to India in 1997, the Under-19 World Cup in South Africa, and the Sri Lanka A tour to England in 1999. In between, he made his Test debut against New Zealand in 1998-99 but looked all at sea in a disappointing display and did not come into consideration after that. But a match haul of 11 for 126 against England A in March 2005 confirmed his growing confidence and also helped attract the attention of Gloucestershire as they looked for a replacement for Upul Chandana. Bandara, like Chandana, is also a useful lower order batsman. He hasn't been able to nail a permanent place in the one-day set-up but has provided valuable support for Muttiah Muralitharan. It is his all-round versatility which won him a World Cup place for the Caribbean ahead of Chandana. He played just one game and has since struggled to find a place in the line-up. He was, however, named in the probables for the Champions Trophy.  \n"], "t20_bowling_innings": "4", "t20_highest_score": "7", "t20_bowling_5W": "0", "t20_stumps": "1", "t20_SR": "80.00", "t20_batting_average": "6.00", "t20_bowling_average": "24.00", "name": "Malinga Bandara", "t20_catches": "0", "t20_bowling_runs": "96", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "12", "t20_bowling_SR": "21.0"},
{"t20_batting_innings": "259", "t20_50": "50", "t20_bowling_4W": "0", "t20_bowling_matches": "148", "t20_batting_matches": "148", "t20_BBM": "2/31", "player_ifo": ["{'Born':'\nJuly 19, 1986, Colombo '}", "{'Current age':'31 years 331 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Batsman'}", "{'Batting style':'Left-hand bat'}"], "t20_BBI": "2/31", "t20_batting_NO": "17", "t20_bowling_econ": "5.02", "t20_bowling_balls": "332", "t20_bowling_10W": "0", "t20_BF": "", "t20_bowling_wickets": "5", "profile": ["\nA prolific run-getter for Ananda College, Mahela Udawatte's talents as a top-order batsman were not immediately recognised when he was overlooked for the Sri Lankan Under-19 team in 2003 despite scoring more than 1000 runs for his school that season. He got his break after he joined Chilaw Marians SC straight after school. Promoted to open the batting - he had batted at No. 3 at school - he reeled off three hundreds in five matches in the 2004-05 U-23 tournament, and was rewarded with a place in the Development Squad. He soon made it into the A team for the tour to England in 2007 after top-scoring for his club in the Premier final against SSC in 2005-06, making 67 out of 172 against an attack which included Dilhara Fernando and Nuwan Zoysa. A powerful and attacking batsman who likes to take on the quick bowlers, Udawatte is seen as a future prospect for the Sri Lanka one-day side, perhaps as a replacement for Sanath Jayasuriya. Rated highly by experts in Sri Lanka, including Mahela Jayawardene, Udawatte earned a call-up to the national squad for the tour of West Indies in 2008. ", " ", " July 2008 \n"], "t20_bowling_innings": "27", "t20_highest_score": "212", "t20_bowling_5W": "0", "t20_stumps": "104", "t20_SR": "", "t20_batting_average": "34.72", "t20_bowling_average": "55.60", "name": "Mahela Udawatte", "t20_catches": "", "t20_bowling_runs": "278", "t20_100": "11", "country": ["Sri Lanka"], "t20_batting_runs": "8403", "t20_bowling_SR": "66.4"},
{"t20_batting_innings": "2", "t20_50": "0", "t20_bowling_4W": "0", "t20_bowling_matches": "6", "t20_batting_matches": "6", "t20_BBM": "2/37", "player_ifo": ["{'Born':'\nMarch 1, 1981, Balapitiya '}", "{'Current age':'37 years 106 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Bowler'}", "{'Batting style':'Left-hand bat'}"], "t20_BBI": "2/37", "t20_batting_NO": "0", "t20_bowling_econ": "8.13", "t20_bowling_balls": "132", "t20_bowling_10W": "0", "t20_BF": "8", "t20_bowling_wickets": "7", "profile": ["\nThushara is one of new fast bowling prospects to emerge in the last two\nyears. From the coastal town of Balapitiya, he made his first-class debut in\n1998-99. After a few years of steady improvement, including a spell in the\nBCCSL's Fast Bowling Unit, he caught the eye of the selectors and was\nincluded for Sri Lanka's tour of South Africa in 2002. He made his Test debut\nagainst West Indies in 2003, but failed to make the Test or ODI squad for\nthe England tour later in the year. No rabbit with the bat, he is a\nhard-hitting striker of the ball and has two first-class half-centuries to\nhis name. He played an important role in Kandurata ending as Inter-provincial limited-overs joint champs in 2008, finishing as the leading wicket-taker in the tournament with 11 wickets. That earned him a recall to the Test squad for the tour of West Indies and he impressed with eight wickets in two Tests. He was later included in the 30-man probables for the Champions Trophy. He has been effective on Sri Lankan pitches, forming a successful partnership with Nuwan Kulasekara. \n", " October 2009 \n"], "t20_bowling_innings": "6", "t20_highest_score": "3", "t20_bowling_5W": "0", "t20_stumps": "2", "t20_SR": "50.00", "t20_batting_average": "2.00", "t20_bowling_average": "25.57", "name": "Thilan Thushara", "t20_catches": "0", "t20_bowling_runs": "179", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "4", "t20_bowling_SR": "18.8"},
{"t20_batting_innings": "103", "t20_50": "14", "t20_bowling_4W": "2", "t20_bowling_matches": "113", "t20_batting_matches": "113", "t20_BBM": "5/21", "player_ifo": ["{'Born':'\nNovember 2, 1973, Kurunegala '}", "{'Current age':'44 years 225 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Allrounder'}", "{'Batting style':'Right-hand bat'}"], "t20_BBI": "5/21", "t20_batting_NO": "11", "t20_bowling_econ": "4.27", "t20_bowling_balls": "725", "t20_bowling_10W": "0", "t20_BF": "", "t20_bowling_wickets": "22", "profile": ["\nJeevantha Kulatunga was the surprise selection for Sri Lanka's Twenty20 squad for the Canada Cup in October 2008, aged 34, but it followed several outstanding domestic seasons. His all-round abilities as an innovative and mentally resilient middle-order batsman capable of playing under pressure, as well as being a wily seam bowler, gave him the edge over less experienced rivals. Sri Lanka's selectors were attracted by his specialist limited-over skills and his huge experience as they tried to strengthen the middle order. He later graduated up the order in T20 cricket for Wayamba, the domestic T20 champions in both 2009 and 2010, carving out a reputation for being one of the most destructive match-winners. In the 2010 season, he finished the third-highest scorer with 277 runs at 69.25 including a 152.19 run strike rate. He was also the first Sri Lankan to score a T20 hundred in domestic cricket and was named Player of the Tournament.  \n", "Kulatunga made his first-class debut in 1990-91 at the age of 17 for Kurunegala Youth CC, scoring 64, and was soon grabbed by the club he scored those runs against - Colts Cricket Club, for whom he has played ever since. With players in the calibre of Romesh Kaluwitharana, Sajith Fernando, Thilan Samaraweera and Chaminda Mendis to bat ahead of him Kulatunga became more or less a permanent fixture at No 5. In 2001 he got his first big break when he was picked to represent a Sri Lanka Board President's XI against England at Matara and he scored a half-century. He secured occasional appearances in the Sri Lanka A team, playing against Pakistan and India, but failed to secure a permanent berth as the selectors then embarked on a youth policy that left several outstanding players in their late 20s with too few opportunities. Instead, he forged a successful career playing in the English leagues during the off season, playing for Barnoldswick CC in the Lancashire Leagues from 2002. However, several years of outstanding performances, especially in limited overs and T20 cricket, propelled him back into contention for the national team by late 2008.. ", " October 2009"], "t20_bowling_innings": "", "t20_highest_score": "132", "t20_bowling_5W": "1", "t20_stumps": "62", "t20_SR": "", "t20_batting_average": "27.55", "t20_bowling_average": "23.45", "name": "Jeevantha Kulatunga", "t20_catches": "", "t20_bowling_runs": "516", "t20_100": "1", "country": ["Sri Lanka"], "t20_batting_runs": "2535", "t20_bowling_SR": "32.9"},
{"t20_batting_innings": "227", "t20_50": "20", "t20_bowling_4W": "", "t20_bowling_matches": "146", "t20_batting_matches": "146", "t20_BBM": "", "player_ifo": ["{'Born':'\nJuly 3, 1980, Colombo '}", "{'Current age':'37 years 347 days'}", "{'Major teams':'Sri Lanka,'}", "{'Batting style':'Right-hand bat'}", "{'Bowling style':'Right-arm fast-medium'}"], "t20_BBI": "7/64", "t20_batting_NO": "16", "t20_bowling_econ": "3.15", "t20_bowling_balls": "16457", "t20_bowling_10W": "0", "t20_BF": "", "t20_bowling_wickets": "354", "profile": ["\nDilhara Lokuhettige is one of the first Sri Lankan cricketers to be labeled a Twenty20 specialist. His reputation as a dangerous Twenty20 player has been built on his powerful batting - as a pinch-hitter or lower order batsman - coupled with his bustling seam bowling.  \n", "As a schoolboy, Lokuhettige captained Asoka Vidyalaya in Colombo from the Under-13 age group up to the First XI. He got his first major break towards earning a national cap when he joined Bloomfield in 1999 and met Ruchira Palliyaguru, the club's fast bowler, who recommended him to the Sri Lanka Cricket fast-bowling academy. There he came under the watchful eyes of Champaka Ramanayake, the head of the academy. Lokuhettige played one season for Antonians SC and then joined Galle CC where Ramanayake was also the coach. Lokuhettige got his international break in 2005 during the Indian Oil Cup but a side strain ruled him out of the following tours to New Zealand and Australia. ", "Lokuhettige is not an express fast bowler but he is accurate and can swing the ball both ways. He is a hard-hitting batsmen too, with his favourite stroke being the lofted drive. Sri Lanka's selectors started to eye him as a possible Twenty20 specialist in 2007 when he was called up to the 20-man training pool for the ICC World Twenty20 in South Africa. He also has a reputation for being a match-winner in six-a-side cricket, having played four times in the Hong Kong Sixes. In 2007 he played a crucial role in helping Sri Lanka win the tournament, smashing 30 in an over during the semi-final against New Zealand. Earlier in 2008 he excelled during the inaugural Provincial Twenty20 tournament in Sri Lanka and also gained experienced playing club cricket in England. Lokuhettige was called up for Sri Lanka's Twenty20 squad in September 2008. ", " October 2008\n"], "t20_bowling_innings": "", "t20_highest_score": "211", "t20_bowling_5W": "11", "t20_stumps": "103", "t20_SR": "", "t20_batting_average": "25.89", "t20_bowling_average": "24.44", "name": "Dilhara Lokuhettige", "t20_catches": "", "t20_bowling_runs": "8653", "t20_100": "7", "country": ["Sri Lanka"], "t20_batting_runs": "5464", "t20_bowling_SR": "46.4"},
{"t20_batting_innings": "8", "t20_50": "0", "t20_bowling_4W": "3", "t20_bowling_matches": "39", "t20_batting_matches": "39", "t20_BBM": "6/8", "player_ifo": ["{'Born':'\nMarch 11, 1985, Moratuwa '}", "{'Current age':'33 years 96 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Bowler'}", "{'Batting style':'Right-hand bat'}"], "t20_BBI": "6/8", "t20_batting_NO": "5", "t20_bowling_econ": "6.45", "t20_bowling_balls": "885", "t20_bowling_10W": "0", "t20_BF": "17", "t20_bowling_wickets": "66", "profile": ["\nAjantha Mendis reintroduced mystery to spin in the era of video analysts and super-slow-motion replays. Much like the original mystery spinner, Jack Iverson, and the other practitioner of the \"Iversons\", John Gleeson, Mendis stunned the world with his finger-flicked legbreaks. His Iversons came with a new name, the \"carrom ball\", taken from the way the striker is flicked in the popular board game in the subcontinent.", " \n", "His first, most famous, and most comprehensive victims were the most prolific middle order of his time: Rahul Dravid, Sachin Tendulkar, VVS Laxman and Sourav Ganguly. Following closely on the heels of a six-for in the Asia Cup final against India's ODI side, Mendis made a sensational Test debut. He took eight wickets in his first Test and 26 in his first series, two more than Alec Bedser's record for a three-match debut series.", "\n \nThe early success was built as much on his variations - offbreaks, topspinners, carrom balls, googlies, ones that did nothing - as it was on accuracy and Muttiah Muralitharan's company. As the mystery wore, though, much like with Iverson and Gleeson, the world caught up with him, and Mendis failed to live up to the early promise. By the time Murali retired, Mendis was not ready to take over as the leading Sri Lankan spinner, a vast change from when he could have emerged as the leading spinner in the world.", "\n \nMendis continues to be an effective spinner in shorter formats where batsmen don't have much time to adjust. He holds the record for the best figures in a T20I innings, but fails to find a regular place in the Sri Lankan side for the longer formats. The rest of his career will be an exercise in trying to rediscover success, this time not through mystery but by being a really good spinner.", " "], "t20_bowling_innings": "39", "t20_highest_score": "4*", "t20_bowling_5W": "2", "t20_stumps": "6", "t20_SR": "47.05", "t20_batting_average": "2.66", "t20_bowling_average": "14.42", "name": "Ajantha Mendis", "t20_catches": "0", "t20_bowling_runs": "952", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "8", "t20_bowling_SR": "13.4"},
{"t20_batting_innings": "270", "t20_50": "46", "t20_bowling_4W": "", "t20_bowling_matches": "170", "t20_batting_matches": "170", "t20_BBM": "", "player_ifo": ["{'Born':'\nDecember 21, 1976, Gampaha '}", "{'Current age':'41 years 176 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Allrounder'}", "{'Batting style':'Left-hand bat'}"], "t20_BBI": "6/23", "t20_batting_NO": "34", "t20_bowling_econ": "3.14", "t20_bowling_balls": "12524", "t20_bowling_10W": "0", "t20_BF": "", "t20_bowling_wickets": "257", "profile": ["\nGayan Wijekoon is an allrounder of considerable talent and has performed at every opportunity against touring sides and on tours with the Sri Lanka A team. However, a place in the national team has so far eluded him, with the selectors often opting for others with lesser performances ahead of Wijekoon. The nearest he came to selection was being part of the Test squad to New Zealand in 2004-05. A lively left-arm \nmedium-pacer and a left-hand batsman, he opened both the batting and the bowling for Tamil Union for many years before joining Chilaw Marians CC in 2003-04. Upul Chandana and Mahela Jayawardene have been the major influences in Wijekoon's career so far. He made his international debut in the home Test series against West Indies in July 2005, though with limited success, picking up two wickets. He was recalled for the Twenty20 World Championship in South Africa after a two-year hiatus and the following year made it to the probables squad for the Champions Trophy.", " \n"], "t20_bowling_innings": "", "t20_highest_score": "150*", "t20_bowling_5W": "3", "t20_stumps": "63", "t20_SR": "", "t20_batting_average": "37.31", "t20_bowling_average": "25.57", "name": "Gayan Wijekoon", "t20_catches": "", "t20_bowling_runs": "6573", "t20_100": "17", "country": ["Sri Lanka"], "t20_batting_runs": "8807", "t20_bowling_SR": "48.7"},
{"t20_batting_innings": "1", "t20_50": "0", "t20_bowling_4W": "-", "t20_bowling_matches": "2", "t20_batting_matches": "2", "t20_BBM": "-", "player_ifo": ["{'Born':'\nNovember 22, 1970, Kalutara '}", "{'Current age':'47 years 205 days'}", "{'Major teams':'Sri Lanka,'}", "{'Batting style':'Right-hand bat'}", "{'Bowling style':'Legbreak'}"], "t20_BBI": "-", "t20_batting_NO": "0", "t20_bowling_econ": "-", "t20_bowling_balls": "-", "t20_bowling_10W": "-", "t20_BF": "8", "t20_bowling_wickets": "-", "profile": ["\nA vulnerable starter, Atapattu showed immense strength of character once he got his eye in. On a lifeless pitch, he was a master of the percentage game, his caution a useful counterpoint to the risks taken by Sanath Jayasuriya, his opening partner almost throughout his Test career. All his big Test innings - he scored six double-hundreds in his career, a feat bettered only by Don Bradman (12), Wally Hammond and Brian Lara (seven each) - were been slow affairs but the most tortuous episode of his international career was its start: it took him nearly seven years to get established. However, since the 1990s his average climbed upwards. An elegant player to watch, Atapattu's signature shot was his high-elbow cover-drive. \n", "For three years he stood as Jayasuriya's understudy before being appointed to lead the one-day side in April 2003. He had been expected to take charge of the Test team as well, but the selection committee appointed Hashan Tillakaratne for that job. Atapattu's career took another bizarre twist later in the year when embroiled in the cash-in-the-bedroom affair in which a match-fixing investigation was initiated after a large sum of cash was discovered in the safe of the hotel room he had occupied during England's tour in 2003. The ICC later cleared Atapattu of any wrongdoing and the likeliest explanation for the mystery remains a crude attempt to blacken his reputation.", "But by early 2004 the team was drifting downwards under Tillakaratne and the selectors were finally compelled to appoint Atapattu as the Test captain. Within weeks he had halted the team's slide and established himself as a strong leader. On the surface a quiet and reserved character, his captaincy pedigree was not entirely obvious to the outsider, but within the dressing-room he was a straight-talking and positive captain, firm and fair in his dealings with the players and aggressive in his approach to the game. By mid-2004 the fortunes of the team had changed as Sri Lanka won the Asia Cup and whitewashed South Africa. The team fared poorly in the ICC Champions Trophy but perked up against Pakistan in October 2004.", "But Atapattu's capacity for attracting the unexpected continued when, out of the blue, Ashantha de Mel, the new government-appointed chairman of selectors, launched a scathing attack on the team management on the eve of the Paktel Cup in 2004-05, accusing them of blocking his attempts to blood new players. Atapattu wisely steered clear of a public confrontation, though his relationship with the selectors remained prickly. ", "His career was put on hold by a back injury early in 2006 which led to Mahela Jayawardene taking on the captaincy. He was slowly reintroduced to the one-day side, but his tussles with the selectors continued. He was a late inclusion on the Australian tour following a ministerial intervention to bring him into the squad, but midway through the series he hit out at the selectors again, calling them \"a set of muppets headed by a joker\". He scored two half-centuries in the series, including 80 in the second innings in Hobart, but announced his retirement from international cricket on the last day of the Test.   ", "Atapattu then joined the unofficial Indian Cricket League, playing for the Delhi Giants and ICL World XI. A ban on he and four other Sri Lankans was lifted in September 2008, meaning Atapattu was free to play domestic cricket back home.", "Since retirement from all cricket, Atapattu has forged a reputation as a technically adroit and hard-working batting coach, particularly for his work with the Sri Lanka team. He has been the national side's batting coach since 2011, and was promoted to the position of assistant coach in March 2013. In the wake of Paul Farbrace's sudden departure from the head coach position a year later, Atapattu was appointed the interim head coach for the away tour of England, and the home tour against South Africa, in July.", "\n", " September 2008\n"], "t20_bowling_innings": "-", "t20_highest_score": "5", "t20_bowling_5W": "-", "t20_stumps": "0", "t20_SR": "62.50", "t20_batting_average": "5.00", "t20_bowling_average": "-", "name": "Marvan Atapattu", "t20_catches": "0", "t20_bowling_runs": "-", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "5", "t20_bowling_SR": "-"},
{"t20_batting_innings": "2", "t20_50": "0", "t20_bowling_4W": "0", "t20_bowling_matches": "2", "t20_batting_matches": "2", "t20_BBM": "-", "player_ifo": ["{'Born':'\nApril 6, 1977, Colombo '}", "{'Current age':'41 years 70 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Bowler'}", "{'Batting style':'Left-hand bat'}"], "t20_BBI": "-", "t20_batting_NO": "2", "t20_bowling_econ": "11.00", "t20_bowling_balls": "42", "t20_bowling_10W": "0", "t20_BF": "0", "t20_bowling_wickets": "0", "profile": ["\nRuchira Perera is a lively and hard-working left-arm fast bowler with the\nability to swing the ball back into right-handers. He lost form and confidence\nafter his action was labelled suspect during Sri Lanka's early-season tour to\nEngland in 2002. After advice from Darryl Foster, a bowling coach and\nbiomechanics expert at the University of Western Australia, he modified his\nwrist position just before the point of delivery and that cleared the\nproblem with his elbow to the satisfaction of Sri Lanka authorities. But\nalthough he returned to international duty in late 2002 against South\nAfrica, his self-belief seeped away and he lost effectiveness. During the\nnext two years he battled hard but gradually became disillusioned, and prior\nto the recent Provincial Tournament was considering a career playing league\ncricket in England. However, he regained form during the Provincial\nTournament and caught the eye of the selectors and was selected for the 2006 tour of England. He's generally good for team spirit, bringing great humour to the dressing-room, and is respected for his commitment with ball in hand. ", "September 2006 \n"], "t20_bowling_innings": "2", "t20_highest_score": "0*", "t20_bowling_5W": "0", "t20_stumps": "0", "t20_SR": "-", "t20_batting_average": "-", "t20_bowling_average": "-", "name": "Ruchira Perera", "t20_catches": "0", "t20_bowling_runs": "77", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "0", "t20_bowling_SR": "-"},
{"t20_batting_innings": "2", "t20_50": "0", "t20_bowling_4W": "0", "t20_bowling_matches": "6", "t20_batting_matches": "6", "t20_BBM": "2/14", "player_ifo": ["{'Born':'\nJanuary 27, 1974, Mattumagala '}", "{'Current age':'44 years 139 days'}", "{'Major teams':'Sri Lanka,'}", "{'Batting style':'Left-hand bat'}", "{'Bowling style':'Left-arm fast-medium'}"], "t20_BBI": "2/14", "t20_batting_NO": "1", "t20_bowling_econ": "5.81", "t20_bowling_balls": "132", "t20_bowling_10W": "0", "t20_BF": "41", "t20_bowling_wickets": "6", "profile": ["\nChaminda Vaas is easily the most penetrative and successful new-ball bowler Sri Lanka have had, and he has served his country well. He swings and seams the ball with skill, his trademark delivery being the late indipper. However, he also bowls a carefully disguised offcutter, and has recently added reverse-swing to his armoury, a skill that has made him a consistent wicket-taker even on bland subcontinental pitches. He outbowled New Zealand's seamers in green conditions at Napier to give Sri Lanka their first win in an overseas Test, in 1994-95. In 2001-02 he made a quantum leap, taking 26 wickets in the 3-0 rout of West Indies, becoming only the second fast bowler, after Imran Khan, to take 14 wickets in a match in the subcontinent. He then went on to take the first-ever ODI eight-for, against Zimbabwe, which included a hat-trick. He also claimed a hat-trick with the first three balls of the match against Bangladesh in the 2003 World Cup. Vaas reached the 300-wicket milestone in Tests against India in 2005-06, having passed the mark in ODIs on the tour to Zimbabwe. In 2004 he also gained overdue recognition for his talent when he was selected for the World XI at the inaugural ICC Awards. Vaas is easily Sri Lanka's second-most successful bowler - after Muttiah Muralitharan - in both forms of the game. His approach to his batting is equally sincere and in recent years he has gradually gained recognition as a useful allrounder. He waited 97 Tests for his maiden century, against Bangladesh, and soon after, became the third Sri Lankan to play 100 Tests or more. \n", "In August 2008, Vaas crossed yet another milestone when he had Yuvraj Singh caught for a duck in Colombo to get his 400th ODI wicket and become the fourth bowler to reach the landmark.  ", "In July 2009, Vaas announced his retirement from Tests but said he will continue to play one-dayers and Twenty20s till the 2011 World Cup. \n"], "t20_bowling_innings": "6", "t20_highest_score": "21", "t20_bowling_5W": "0", "t20_stumps": "0", "t20_SR": "80.48", "t20_batting_average": "33.00", "t20_bowling_average": "21.33", "name": "Chaminda Vaas", "t20_catches": "0", "t20_bowling_runs": "128", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "33", "t20_bowling_SR": "22.0"},
{"t20_batting_innings": "15", "t20_50": "0", "t20_bowling_4W": "0", "t20_bowling_matches": "16", "t20_batting_matches": "16", "t20_BBM": "1/4", "player_ifo": ["{'Born':'\nDecember 14, 1979, Panadura '}", "{'Current age':'38 years 183 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Batsman'}", "{'Batting style':'Right-hand bat'}"], "t20_BBI": "1/4", "t20_batting_NO": "2", "t20_bowling_econ": "5.00", "t20_bowling_balls": "18", "t20_bowling_10W": "0", "t20_BF": "177", "t20_bowling_wickets": "1", "profile": ["\nChamara Silva first arrived on the scene as a slightly-built 19-year-old in 1999, a beneficiary of the youth policy adopted by Sidath Wettimuny, the chairman of the selectors at the time. He began with a promising 54 on his ODI debut against Australia. His mannerisms while batting - particularly bow-legged stance and the flamboyant cover drives - immediately attracted comparisons with the great Aravinda de Silva. But despite being prodigiously talented, he failed to nail down a regular place during tours to Sharjah (1999), Zimbabwe (1999), Pakistan (2000) and England (2002). After the England tour he dropped out of the selectors' radar and returned to domestic cricket where he captained Panadura Cricket Club. Over the next four years he was a prolific run-scorer, especially after a move to Sebastianites for the 2004-05 season. Eventually he caught the eye of Tom Moody, who could not understand why he was not in the national squad. A quick promotion back into the Sri Lanka A team followed and after a successful tour to India he won a long overdue international recall. Still just 27, he was a surprise selection for the New Zealand tour and was handed his maiden cap in the first Test at Christchurch. It was an inauspicious start as he bagged a pair and Sri Lanka lost by five wickets. Sri Lanka's team management, however, kept faith for the second Test in Wellington and he rewarded them handsomely, scoring 61 in the first innings and a magnificent unbeaten 152 in the second. His maiden one-day century followed in India, just three weeks before the World Cup.", "\n", " February 2007 \n"], "t20_bowling_innings": "2", "t20_highest_score": "38", "t20_bowling_5W": "0", "t20_stumps": "5", "t20_SR": "98.87", "t20_batting_average": "13.46", "t20_bowling_average": "15.00", "name": "Chamara Silva", "t20_catches": "3", "t20_bowling_runs": "15", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "175", "t20_bowling_SR": "18.0"},
{"t20_batting_innings": "2", "t20_50": "0", "t20_bowling_4W": "0", "t20_bowling_matches": "12", "t20_batting_matches": "12", "t20_BBM": "3/29", "player_ifo": ["{'Born':'\nApril 17, 1972, Kandy '}", "{'Current age':'46 years 59 days'}", "{'Major teams':'Sri Lanka,'}", "{'Also known as':'Muttiah Muralidaran'}", "{'Playing role':'Bowler'}"], "t20_BBI": "3/29", "t20_batting_NO": "0", "t20_bowling_econ": "6.31", "t20_bowling_balls": "282", "t20_bowling_10W": "0", "t20_BF": "5", "t20_bowling_wickets": "13", "profile": ["\nPerhaps no cricketer since Douglas Jardine has polarised opinion quite like Muttiah Muralitharan. For the believers, he's among the greatest to ever spin a ball. For the doubters, he's a charlatan undeserving of the game's greatest records, responsible for changes in the laws that they think have legitimised throwing. What was undeniable was his ability to turn the ball sharply on just about any surface, and bowl the sort of marathon spells that would have seen a lesser man retire after five seasons rather than 18. Whether Sri Lanka played at home, on pitches where he was often unplayable, or overseas, Murali was the go-to man for half a dozen captains. He seldom disappointed. \n", "Scion of a family with confectionery interests in Kandy, he first came to prominence during a tour game against Australia in 1992-93, when no less a batsman than Allan Border failed to pick him. From the outset, his action was an object of wonder or ridicule, depending on which side of the fence you stood. A deformed elbow was only part of the story. Murali had exceptionally supple wrists and a shoulder that rotated as rapidly as a fast bowler's at the time of delivery. A combination of all these factors combined to enable him to turn the ball far more than most orthodox finger-spinners, but it was only with his mastering the doosra, the one that went the other way or held its line, that he became Shane Warne's rival in the wicket-taking and greatness stakes. ", "The controversies always kept him company, yet Murali seldom lost his wide-eyed smile, or the ability to run through batting sides. Darrell Hair called him for throwing on Boxing Day in 1995, and Ross Emerson followed suit three years later. In 2004, he was asked to refrain from bowling his doosra, after it was found to exceed the 15-degree tolerance limit that had been agreed on after extensive analysis of his and other actions. While the sceptics continued to denigrate his achievements, Murali even bowled on television in a special cast, going through his entire repertoire to try and convince the doubters.", "Part of the World Cup-winning side in 1996, he was instrumental in the run to the final 11 years later, and he played his part in some of the country's greatest sporting moments. It was his 16 wickets that helped rout England at The Oval in 1998, back in the days when Sri Lanka were deemed worthy of only one Test. He averaged less than 30 with the ball in every country except India and Australia, and he finished a remarkable Test career with more than 100 wickets against India, England and South Africa. ", "Backed to the hilt by Arjuna Ranatunga, he blossomed in the late 1990s, and there was a period when the opposition routinely budgeted for 20 Murali wickets or more in a three-Test series. As the years passed, his shyness gave way to a quiet confidence and wry sense of humour, and he won admirers around the world for the energy, time and money that he invested in reconstruction after a tsunami had devastated the Sri Lankan coast in 2004. Often the only Tamil in the side in a time of ethnic conflict, he became as powerful a unifying force as any in the country. That he was such a hero with ball in hand was only part of the story.", "\n"], "t20_bowling_innings": "12", "t20_highest_score": "1", "t20_bowling_5W": "0", "t20_stumps": "1", "t20_SR": "20.00", "t20_batting_average": "0.50", "t20_bowling_average": "22.84", "name": "Muttiah Muralitharan", "t20_catches": "0", "t20_bowling_runs": "297", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "1", "t20_bowling_SR": "21.6"},
{"t20_batting_innings": "26", "t20_50": "0", "t20_bowling_4W": "-", "t20_bowling_matches": "26", "t20_batting_matches": "26", "t20_BBM": "-", "player_ifo": ["{'Born':'\nFebruary 2, 1985, Balapitiya '}", "{'Current age':'33 years 133 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Batsman'}", "{'Batting style':'Left-hand bat'}"], "t20_BBI": "-", "t20_batting_NO": "1", "t20_bowling_econ": "-", "t20_bowling_balls": "-", "t20_bowling_10W": "-", "t20_BF": "330", "t20_bowling_wickets": "-", "profile": ["\nA batsman who has frustrated and thrilled in equal measure. Although his Test career has never really taken off - his two Test centuries have come more than 10 years apart - in ODIs he keeps illustrious company among Sri Lanka's finest. As of 2017, only Mahela Jayawardene, Tillakaratne Dilshan, Kumar Sangakkara and Sanath Jayasuriya had scored more than Tharanga's 13 one-day centuries \n", "Tharanga's call-up to the Sri Lanka one-day squad in July 2005 brightened a year marred by the Asian tsunami, which washed away his family home in Ambalangoda, a fishing town on the west coast. From an early age he was tipped for the big time, playing Premier League cricket for Singha CC at the age of 15 and passing seamlessly and successfully through the Sri Lanka Under-15, Under-17 and Under-19 development squads. He first really caught the eye during the Under-19 World Cup in 2004 when he cracked 117 against South Africa and then 61 in 42 balls against India in the next game. Then, after a successful tour with the under-19 team to Pakistan, during which he scored half-centuries in each of the two Tests and two one-day matches, the Sri Lankan board sent him to play league cricket in Essex, where he starred for Loughton Cricket Club. ", "He soon graduated to the A team and after accomplished performances against West Indies A he was selected for the national squad a week later. However, it was on the 2006 tour of England that he really began to develop, especially in the one-day game, with an outstanding century at Lord's in the first match of Sri Lanka's 5-0 whitewash, and another in the final match as he and Jayasuriya flayed an opening stand of 286 in 32 overs.", "Back-to-back centuries followed in the Champions Trophy and he was forming a destructive partnership with Jayasuriya. After the Champions Trophy, however, it would be another three years until his next century. He flourished at the 2011 World Cup with score of 133 against Zimbabwe and an unbeaten 102 in the quarter-final against England.", "In 2013, during a tri-series in the Caribbean, he struck an unbeaten 174 against India in Jamaica but that would be his last fifty-plus score for 18 innings spread over three years during which time he spent considerable periods outside the team. He briefly returned when called up as an injury replacement at the 2015 World Cup, but his 2016 comeback provided slightly more longevity and he was named captain for the tri-series in Zimbabwe, a position he retained when Angelo Mathews was ruled out of the 2017 series in South Africa.", "\n"], "t20_bowling_innings": "-", "t20_highest_score": "47", "t20_bowling_5W": "-", "t20_stumps": "2", "t20_SR": "123.33", "t20_batting_average": "16.28", "t20_bowling_average": "-", "name": "Upul Tharanga", "t20_catches": "12", "t20_bowling_runs": "-", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "407", "t20_bowling_SR": "-"},
{"t20_batting_innings": "53", "t20_50": "8", "t20_bowling_4W": "-", "t20_bowling_matches": "56", "t20_batting_matches": "56", "t20_BBM": "-", "player_ifo": ["{'Born':'\nOctober 27, 1977, Matale '}", "{'Current age':'40 years 231 days'}", "{'Major teams':'Sri Lanka,'}", "{'Playing role':'Wicketkeeper batsman'}", "{'Batting style':'Left-hand bat'}"], "t20_BBI": "-", "t20_batting_NO": "9", "t20_bowling_econ": "-", "t20_bowling_balls": "-", "t20_bowling_10W": "-", "t20_BF": "1156", "t20_bowling_wickets": "-", "profile": ["\nAs soon as he broke into the side at the age of 22, while a law student, it was apparent that Kumar Sangakkara was destined for more than just batting stardom. The left-handers that had preceded him, like Arjuna Ranatunga and Asanka Gurusinha, had been pugnacious battlers but Sangakkara was cut from more graceful cloth, easing into strokes with the elegance often associated withthose that play with the 'other' hand. The cut and the pull came naturally to him and with growing confidence, he became a more assured front-foot player as well. \n", "Ranatunga had already exploded the myth of the Sri Lankans being meek men who could be bullied, but Sangakkara has refined the belligerence, combining a suave exterior with cutting asides and sharp sledges from behind the stumps. Initially, his glovework wasn't for the purists, but such was his batting ability that there was no question of displacing him from the XI.", "As a batsman, he has matured steadily, and the appetite for runs was best illustrated at the Sinhalese Sports Club Ground in Colombo in 2006, when he and Mahela Jayawardene, captain and close friend, added 624 against a South African attack boasting Dale Steyn and Makhaya Ntini. Sangakkara contributed 287 and did his burgeoning reputation no harm a year later when he went to Hobart and scored a dazzling 192 in a close defeat. By then, he already had a half-century in a World Cup final to his name, and long before Jayawardene relinquished the captaincy, it was understood that Sangakkara would be the anointed one.", "He has been far less relentless in the one-day arena, often throwing his wicket away when well set, but his leadership qualities have made him a sought-after signing in the Indian Premier League. With the captain's burden on his shoulders, he no longer keeps in Test matches, but the smart-alec remarks from behind the stumps are a common feature of every game that Sri Lanka plays in coloured clothes.\n \nAlthough leadership drew the best from him as a batsman, he remains a voracious no. 3 in all forms despite having relinquished the reins in 2011. Sangakkara won the top prize at 2012's ICC awards, in addition to the award for Test Cricketer of the Year and the People's Choice award for the second year running. Later that year he confirmed himself among batting's modern greats, by becoming the equal fastest man to 10,000 Test runs alongside Sachin Tendulkar and Brian Lara, with the biggest Test crowd Sri Lanka had ever played for in audience, at the Melbourne Cricket Ground. ", "."], "t20_bowling_innings": "-", "t20_highest_score": "78", "t20_bowling_5W": "-", "t20_stumps": "25", "t20_SR": "119.55", "t20_batting_average": "31.40", "t20_bowling_average": "-", "name": "Kumar Sangakkara", "t20_catches": "20", "t20_bowling_runs": "-", "t20_100": "0", "country": ["Sri Lanka"], "t20_batting_runs": "1382", "t20_bowling_SR": "-"}
]